[
  {
    "Project objective": "The Three Hats of Theater: Creating Your Own Mini-Plays!",
    "Steps": [
      "Begin by researching about Drama, Comedy, and Tragedy. Read a few examples of each genre and notice how they differ in themes, tone, and style. Write a brief summary of your findings.",
      "Come up with a simple, humorous scenario that could potentially be a Comedy, Drama, and Tragedy. Consider a situation like: \"An alien lands on Earth and tries to navigate a supermarket\".",
      "Create the main characters for your scenario. Think about their personalities, their motives, and their goals. Remember, in comedy, characters often have exaggerated traits; in drama, they may have more complex motivations; and in tragedy, they're likely to face significant challenges.",
      "Write a short script for your scenario as a comedy. Remember, the main ingredient of comedy is humor, which can come from slapstick, wordplay, or absurd situations.",
      "Now, rewrite the same scenario as a drama. Here, the tone changes, the stakes are real, and the characters need to deal with their challenges in a serious way.",
      "Finally, rewrite the scenario as a tragedy. The tone becomes darker, and the outcome might be grim. Characters may not achieve their goals, and there's a lesson to be learned.",
      "Revise your scripts based on the feedback you received. Make sure the dialogue is sharp, the characters are well developed, and the genre is clear.",
      "Now it's time to present your work! You can perform the scripts yourself, record voiceovers, or even use an animation software to bring your scripts to life. Remember, you're not just a writer, you're a director too!",
      "Reflect on the process of writing in three different genres. How did the tone of the script change? How did the characters and dialogue need to adapt to fit the Comedy, Drama, and Tragedy? Write a short reflection on your process and what you learned."
    ]
  },
  {
    "Project objective": "One-Actor Show: Crafting Your Solo Performance!",
    "Steps": [
      "Once you have your idea, start writing your monologue. Remember to develop a unique voice for your character and to create a compelling story arc.",
      "Insert stage directions into your monologue. Where does the character move? How do they interact with their environment? Do they pace when they're nervous, or freeze in place?",
      "Identify key props that your character can interact with during their monologue. This could be anything from a map for your explorer to a circuit board for your robot. Draw a list of these props and note how they can be used in the monologue.",
      "Using your monologue and stage directions, design a set. This could be a hand-drawn sketch, a 3D model created on the computer, or even a miniature model crafted from household items.",
      "Choose one prop from your list and create it! This could be as simple as crafting a map from old paper and markers, or as complex as building a robot arm from cardboard and tin foil.",
      "Create one element of your costume. This could be a safari hat for your explorer, or LED lights attached to a shirt for your robot. Safety first - make sure any costume element is safe and comfortable to wear!",
      "It's time for the big show! Perform your monologue, incorporating your stage directions, props, and costume. This could be filmed or performed live for family and friends.",
      "Reflect on the process. What did you learn about how stage directions, props, costume, and set design can influence and enhance a monologue? Write a short reflection detailing your experiences.",
      "Equipment Needed: Computer, internet connection, paper, writing utensils, household craft supplies for prop and costume creation, and a camera if filming the performance.",
      "And remember, when performing your monologue - you're not just narrating the story, you're living it!"
    ]
  },
  {
    "Project objective": "Behind the Scenes: Become a Theatre Technologist!",
    "Steps": [
      "Choose a scene from a play that you enjoy. If possible, pick one that has changes in mood or tone that could be emphasized by different lighting or sound effects.",
      "Read the scene multiple times to fully understand the story, characters, and emotions portrayed. Write down any ideas that come to mind regarding the use of lighting and sound.",
      "Research the basics of lighting and sound design in theater. Try to understand how they can be used to enhance the storytelling.",
      "Create a lighting design plan for your scene. Where would you place the lights? What colors would you use? How would the lighting change throughout the scene?",
      "Next, create a sound design plan. What music, sound effects, or ambient noise could add depth to the scene?",
      "Plan an improvisation exercise based on your scene. This could involve coming up with alternate dialogues, actions, or endings. Remember, in improv there are no mistakes, only opportunities!",
      "Based on the dialogues and actions in the scene, plan the blocking. Where do the characters move and when? Remember to take the lighting design into account.",
      "Using a software like SketchUp or even hand-drawing, create a mock-up of the stage with your set, lighting, and blocking plans.",
      "Create a rehearsal plan. How would you break down the scene to practice? What aspects would you focus on in each rehearsal?",
      "Reflect on your experience. What did you learn about the different elements of theater production? How do you think the behind-the-scenes work impacts the final performance?"
    ]
  }
]