[
  {
    "Project objective": "You're the Chief Financial Officer (CFO) of Starship Enterprise Inc., a company specializing in intergalactic trade. Your mission is to navigate through the cosmos of corporate finance, exploring the concepts of corporate tax rates, taxable income, deductions, tax credits, and depreciation. The goal? To successfully plan for the company's financial year and minimize tax liabilities. May the finance force be with you!",
    "Steps": [
      "Familiarize Yourself with Corporate Finance: Research the basics of corporate finance with a special focus on the concepts listed. Write a summary of your findings.",
      "Understanding Corporate Tax Rates: Investigate the current corporate tax rates. Write a brief report on how these rates might impact Starship Enterprise Inc.",
      "Identify Taxable Income: Assume a hypothetical income for Starship Enterprise Inc. from intergalactic trade. Document this income as the starting point for your tax planning.",
      "Exploring Deductions: Identify potential deductions that Starship Enterprise Inc. could be eligible for. Write a paragraph explaining each deduction and its impact on the taxable income.",
      "Applying Tax Credits: Research different corporate tax credits. Hypothetically apply suitable credits to Starship Enterprise Inc.'s situation.",
      "Depreciation of Spaceships: Investigate how depreciation works, particularly for assets like spaceships. Calculate the depreciation of Starship Enterprise Inc.'s fleet and how it affects the taxable income.",
      "Tax Calculation: Using the information gathered, calculate the estimated tax liability of Starship Enterprise Inc. Show your work!",
      "Financial Report: Draft a mock financial report summarizing Starship Enterprise Inc.'s taxable income, deductions, credits, depreciation, and overall tax liability.",
      "Reflection: Write a one-page reflection on your experience. What did you find most challenging? What surprised you about corporate taxes?"
    ]
  },
  {
    "Project objective": "You are the newly appointed Tax Analyst for CoasterCraft Inc., a multinational corporation that designs and manufactures rollercoasters. Your task? To navigate the thrilling ups and downs of carryovers and carrybacks, transfer pricing, tax loss provisions, dividends-received deduction, and foreign tax credits. Get ready for a wild ride!",
    "Steps": [
      "Understand the Concepts: Start by researching the five tax concepts. Note down their definitions and real-world implications for corporations.",
      "Carryovers and Carrybacks Ride: CoasterCraft Inc. had a profitable year followed by a loss. Illustrate how carryovers and carrybacks work by creating a hypothetical financial scenario for the company.",
      "Transfer Pricing Loop-the-loop: Explore the concept of transfer pricing. Assume CoasterCraft Inc. trades components between its U.S. and French divisions. Create a hypothetical scenario showing how transfer pricing could affect the company's tax obligations.",
      "Tax Loss Provisions Twister: Identify tax loss provisions that apply to CoasterCraft Inc. Discuss how these provisions can reduce the company's tax liability in a lean year.",
      "Dividends-Received Deduction Drop: CoasterCraft Inc. has received dividends from a subsidiary company. Explain the dividends-received deduction and how it applies in this situation.",
      "Foreign Tax Credits Corkscrew: CoasterCraft Inc. pays taxes in multiple countries. Understand and illustrate how foreign tax credits prevent double taxation.",
      "Tax Calculation: Now, using your hypothetical scenarios, calculate CoasterCraft Inc.'s tax liability. Be sure to explain how each concept has affected the final amount.",
      "Create a Digital Poster: Use an online graphic design tool to create a digital poster summarizing your findings. Be creative!",
      "Presentation Time: Make a video presentation explaining CoasterCraft Inc.'s tax journey. Use your digital poster as a visual aid.",
      "Reflection: Write a reflection on what you've learned from this project. What was the most surprising thing about corporate tax?"
    ]
  },
  {
    "Project objective": "Welcome to the Non-Profit Wonders Circus! You're the newly appointed Finance Manager, and your job is to juggle the tax challenges and opportunities this tax-exempt organization faces. From tax deferral strategies to handling a Controlled Foreign Corporation (CFC), to complying with tax reporting requirements and leveraging tax incentives and subsidies, you've got a lot on your plate. Let's put on a show!",
    "Steps": [
      "Understanding the Concepts: Start by researching the five tax concepts. Write a brief description of each and explain how they apply to non-profit organizations.",
      "Tax-Exempt Organizations – The Big Top: Create a profile for Non-Profit Wonders Circus. What is its mission? What services does it provide? Why is it tax-exempt?",
      "Tax Deferral Strategies – The Trapeze Act: Non-Profit Wonders has some income-generating activities. Research and outline a hypothetical tax deferral strategy that the circus could employ.",
      "Controlled Foreign Corporations – The International Act: Non-Profit Wonders has a subsidiary circus in Canada. Explain what a Controlled Foreign Corporation is and how it impacts the circus’s tax situation.",
      "Tax Reporting Requirements – The Balancing Act: Investigate the specific tax reporting requirements for Non-Profit Wonders. What forms need to be filed? What information must be included?",
      "Tax Incentives and Subsidies – The Grand Finale: Research the tax incentives and subsidies available for non-profit organizations. How could Non-Profit Wonders Circus benefit from these?",
      "Calculating Taxes: Using the information you've gathered, calculate the potential tax savings for Non-Profit Wonders from the tax deferral strategy and tax incentives.",
      "Infographic Creation: Use an online graphic design tool to create an infographic summarizing Non-Profit Wonders Circus's tax situation.",
      "Video Presentation: Create a video presentation explaining the tax challenges and opportunities for Non-Profit Wonders. Use your infographic as a visual aid.",
      "Reflection: Write a reflection on what you've learned from this project. What surprised you the most about the tax situation of non-profit organizations?"
    ]
  }
]