[
  {
    "Project objective": "My Journey to the Future - A Career Exploration Project",
    "Steps": [
      "Start by asking yourself what you enjoy doing. What are your hobbies, interests, strengths, and values? Write these down in a journal or online document. Try to understand why these things interest you and how they might be linked to certain professions.",
      "With the list of your interests and strengths, look up careers that align with these aspects. For each career, note down the job description, required skills, education, and potential growth opportunities.",
      "Contact a professional in the field of your interest (via email, social media, etc.) and request a short interview. Prepare and ask questions about their career journey, their day-to-day tasks, and any advice they might have for someone interested in their field.",
      "Imagine you're a part of the team planning the first permanent settlement on Mars. What career role would you play and why? Could you be a Space Architect designing the habitats, or a Space Farmer developing sustainable food sources? Write a one-page paper on how your chosen career would contribute to this scenario.",
      "Research and outline the educational pathway required for your chosen career. What courses or majors are commonly pursued in college? Are there any specific schools known for this field? What additional training or certifications might be necessary?",
      "Using your research, create a visual roadmap of your potential career journey. Include your starting point (high school), educational steps, potential internships, and job positions you might hold as you progress in your career.",
      "Imagine a company in your chosen field is struggling and about to go bankrupt. You've been hired to turn things around. Write a proposal detailing the actions you'd take, using the skills and knowledge from your chosen career.",
      "Pick another career from your initial interest list and repeat steps 2 and 5. Then, compare and contrast these two career paths. Consider factors such as required education, work-life balance, salary, job market demand, and the alignment with your interests.",
      "Reflect on what you've learned during this project. Has your perspective on the chosen careers changed? Do you feel more or less interested in the paths you've explored? Write a reflection piece discussing your thoughts and feelings.",
      "Finally, using a platform like Google Slides or PowerPoint, compile your research, findings, and reflections into a cohesive presentation. Include your interest inventory, career research, interview summary, hypothetical scenarios, and career roadmaps. This will act as your final deliverable for the project."
    ]
  }
]