[
  {
    "Project objective": "My Future University - A Virtual Exploration of College Life",
    "Steps": [
      "Watch videos or read age-appropriate articles about what college life is like. Write down at least five things that seem interesting or exciting about going to college.",
      "Research the different types of colleges (e.g., community colleges, universities, vocational schools, etc.). Create a list describing each type and what makes it unique.",
      "Look up different college majors and degrees. Pick three that seem interesting to you and write a brief description of each.",
      "Imagine you are the founder of a brand-new university. Describe this university in detail. What would its name be? Where would it be located? What majors would it offer? What fun activities or clubs would it have? Draw or design a logo for your university using an online design tool.",
      "Learn about the general requirements for college admission, such as grades, entrance exams, and extracurricular activities. Create a checklist of things a student would need to do to apply.",
      "Take virtual tours of a few different colleges online. Write down a few interesting things you learned about each college you \"visited.\"",
      "Pretend you are applying to your Dream University that you created in step 4. Create a mock application with your future accomplishments, such as your intended major, a list of hypothetical extracurricular activities, and why you want to attend this university.",
      "Learn about the concept of financial aid and scholarships. Write a short essay explaining why financial aid is important and how scholarships are earned.",
      "Research and write a paragraph on the importance of a college degree. How can it impact someone's life and career?",
      "Using a tool like Google Slides or PowerPoint, compile your research, dream university, mock application, and reflections into a comprehensive presentation. This will serve as the final product of your project."
    ]
  }
]