[
  {
    "Project objective": "Learn about setting a housing budget, prioritizing location, inspecting potential homes, saving for a down payment, and getting pre-approved for a mortgage through an exciting, mission-based adventure.",
    "Steps": [
      "Pen and paper for notes and brainstorming",
      "Create your home buyer agent persona: Invent an imaginative home buyer agent character with a backstory focused on helping clients find their dream homes while mastering personal finance skills.",
      "Prioritize location: Investigate factors that contribute to a desirable location, including schools, transportation, amenities, safety, and property values. Create a list of must-haves and nice-to-haves for your ideal neighborhood.",
      "Become an inspection expert: Learn about the importance of thorough home inspections and what to look for during the process. Develop a checklist of potential issues to be aware of when evaluating homes.",
      "Get pre-approved for a mortgage: Learn about the mortgage pre-approval process, including the documents required and the factors that lenders consider when determining your eligibility. Complete a mock mortgage pre-approval application to understand the process better.",
      "House hunt simulation: Browse real estate listings online and select several homes that fit your budget, location preferences, and inspection criteria. Evaluate each property's pros and cons and create a shortlist of top contenders.",
      "Assemble your home buying toolkit: Compile a list of resources, such as websites, apps, and books, to help you continue learning about personal finance and the home buying process.",
      "Reflect on your House Hunters Academy experience: Write a reflection on your experience becoming a home buyer agent and mastering personal finance skills through this project. Share what you've learned and how these concepts apply to your real-life financial journey."
    ]
  },
  {
    "Project objective": "Learn about considering resale value, negotiating wisely, checking for incentives, planning for closing costs, and thinking long-term through an intriguing puzzle-solving adventure.",
    "Steps": [
      "Pen and paper for notes and brainstorming",
      "Create your property puzzle solver persona: Invent a captivating puzzle solver character with a backstory focused on deciphering the mysteries of smart home buying.",
      "Consider resale value: Research factors that contribute to a property's resale value, such as location, condition, and local market trends. Create a list of key elements to look for when evaluating a home's potential resale value.",
      "Negotiate wisely: Learn about the art of negotiation in real estate transactions, including researching comparable sales, preparing a strong offer, and being willing to compromise. Develop a mock negotiation scenario to practice your skills.",
      "Check for incentives: Investigate different types of home buyer incentives, such as tax credits, down payment assistance programs, and reduced interest rates. Identify any incentives you may be eligible for and calculate their potential impact on your home purchase.",
      "Plan for closing costs: Research the various closing costs associated with buying a home, including loan origination fees, title insurance, and appraisal fees. Estimate the total closing costs for a hypothetical home purchase and incorporate them into your overall home buying budget.",
      "Think long-term: Consider the long-term implications of homeownership, such as maintenance costs, potential renovations, and the impact of changing life circumstances. Develop a list of questions to ask yourself when evaluating whether a property fits your long-term goals.",
      "Reflect on your property puzzle-solving journey: Write a reflection on your experience unlocking the secrets of smart home buying through The Property Puzzle Challenge. Share what you've learned and how these concepts apply to your real-life financial journey."
    ]
  }
]