[
  {
    "Project objective": "Time Traveling Economists: A Keynesian Adventure",
    "Steps": [
      "Begin your adventure by researching the principles of Keynesian economics. Note down the key concepts such as demand-side economics, government spending, the multiplier effect, full employment, and liquidity preference.",
      "Prepare the following: Computer with Internet access, presentation software (like PowerPoint, Prezi, or online tools like Canva), research resources (online economic journals, textbooks, documentaries, etc.)",
      "Imagine you're a time-traveling economist, transported back to the Great Depression era (1929-1939). Your mission? Help the government navigate this economic downturn using Keynesian principles.",
      "Draft an economic policy focused on demand-side economics to kick-start the economy. Explain how boosting demand for goods and services can stimulate economic growth during a recession.",
      "Using the idea of government spending as a tool, design a hypothetical \"New Deal 2.0\". This could involve infrastructure projects, public works, and other initiatives that could provide jobs and stimulate economic activity.",
      "Illustrate how the multiplier effect would work in the context of your \"New Deal 2.0\". Explain how initial spending would lead to increased consumption and further economic activity.",
      "Explain how your policy would help the economy reach a state of full employment, and why this is a key goal in Keynesian economics.",
      "Explore the concept of liquidity preference in Keynesian economics. Discuss how it relates to interest rates and how it could be used to influence economic behavior during the Great Depression scenario.",
      "Create a series of diagrams or infographics that visually represent how your Keynesian policies would impact the economy during the Great Depression. Show the expected flow-on effects from government spending to increased demand and employment.",
      "Compile your research, policy proposal, and visual aids into a dynamic presentation. This could be a slideshow, a video, a website, or even a comic strip. Your goal is to present your Keynesian economic plan in a way that's engaging, understandable, and shows your command of the concepts involved.",
      "Reflect on your project, and write a one-page summary of what you've learned about Keynesian economics. Additionally, consider and discuss potential criticisms or limitations of your proposed plan. Have your views on Keynesian economics changed after working on this project? Why or why not?"
    ]
  },
  {
    "Project objective": "Economic Rollercoaster: Navigating Hayekian Hills and Valleys.  Imagine you're stranded on a deserted island with a group of people, and you've been selected as the island's chief economist. Your task? Build a thriving island economy using Hayekian principles.",
    "Steps": [
      "Prepare the following: Computer with Internet access, presentation software (like PowerPoint, Prezi, or online tools like Canva), research resources (online economic journals, textbooks, documentaries, etc.).",
      "Implement Say's Law on your island. Propose a system where production drives demand, not the other way around. Explain how this would work in the island scenario.",
      "Elaborate on Hayek's business cycle theory. How would your island economy navigate the ups and downs of economic expansion and contraction?",
      "As the island's chief economist, propose a monetary policy. What will be used as currency? How will you prevent inflation or deflation?",
      "Plan a fiscal policy for your island economy. How will you manage government spending and taxation (even if the \"government\" is just you and a council of coconut-clad islanders)?",
      "Address the issue of price and wage rigidity. How will you ensure prices and wages remain flexible and responsive to changes in the island's economy?",
      "Create a series of diagrams or infographics that visually represent how your Hayekian policies would impact your island economy over time.",
      "Compile your research, policy proposals, and visual aids into a dynamic presentation. This could be a slideshow, a video, a website, or even a comic strip. Your goal is to present your Hayekian economic plan in an engaging, understandable, and entertaining way.",
      "Reflect on your project and write a one-page summary of what you've learned about Hayek's economic theories. Discuss potential criticisms or limitations of your proposed plan. Have your views on Hayek's ideas changed after working on this project? Why or why not?"
    ]
  },
  {
    "Project objective": "The Big Save: A Tale of Interest, Inflation, and Invisible Hands",
    "Steps": [
      "Prepare the following: Computer with Internet access, spreadsheet software (like MS Excel or Google Sheets), graphic design tool (like Canva), and research resources (online economic journals, textbooks, documentaries, etc.).",
      "Learn about the role of savings in an economy. As a banker, how would you encourage the residents of Dollarville to save more? Think of innovative schemes or incentives.",
      "Educate yourself on the concept of inflation. What causes it? What are its effects? As the town's leading economic figure, how would you explain the concept of inflation to the townsfolk?",
      "Understand the concept of economic equilibrium. As the banker, how would you ensure Dollarville reaches this state?",
      "Put theory into practice. Create a virtual bank for Dollarville using a spreadsheet or a simple online banking software simulation. Set the interest rates, encourage savings, manage inflation, and strive for economic equilibrium.",
      "Now, introduce a twist. Let's say Dollarville has been struck by an economic shock – a sudden surge in demand for a local product. How would this affect your interest rates, savings, inflation, and equilibrium?",
      "Represent the impact of the economic shock and your subsequent actions on the town's economy graphically. You could use line graphs to show changes in savings, bar graphs to represent inflation, etc.",
      "Reflect on how free-market capitalism might naturally respond to the shock in Dollarville. Write a brief essay comparing your interventions as a banker with what might have happened in a completely free market.",
      "Compile your research, actions, and reflections into a comprehensive report. Include your original interest rates, saving schemes, inflation plans, equilibrium strategies, and your reactions to the economic shock. Reflect on how your understanding of these economic concepts has deepened."
    ]
  }
]