[
  {
    "Project objective": "You are now an adult (well, a 25-year-old) living in a small town called \"Taxville\" in the state of \"Financia\". You work as a graphic designer for a cool tech start-up, have a 3-year-old child, and you're also attending night school to advance your career. You've decided to start saving for retirement (because you heard it's a smart thing to do). It's time to file your first tax return, and you want to ensure you claim all the credits and deductions that apply to you.",
    "Steps": [
      "Research the basics: Learn about the concept of personal taxes, why we pay them, and their impact on our finances. Write a brief summary.",
      "Understanding the standard deduction: Discover what the standard deduction is and how it impacts your taxable income. Note down the current standard deduction amount for your filing status.",
      "Earned Income Tax Credit (EITC): Investigate what the Earned Income Tax Credit (EITC) is, its eligibility requirements, and how it might benefit you. Write a short paragraph explaining if you qualify for EITC and why.",
      "Retirement savings contributions: Find out how contributing to a retirement savings plan can affect your tax situation. Assume you've contributed a certain amount to a 401(k) plan. Calculate how this reduces your taxable income.",
      "Education tax credits: Learn about the different education tax credits available (like the American Opportunity Tax Credit and the Lifetime Learning Credit). Determine if you're eligible for any, considering your night school education.",
      "Child Tax Credit: Understand the Child Tax Credit and its eligibility requirements. Calculate how much you could receive for your 3-year-old child.",
      "Filing your mock tax return: Using the information gathered, complete a mock tax return using a free online tax software. You can use fake names and addresses, but try to make the income and expense figures as realistic as possible.",
      "Analysis of your mock tax return: Write a brief report analyzing the outcome of your mock tax return. How much was your tax liability? How much was your refund? How did the standard deduction, EITC, retirement savings contributions, education tax credits, and Child Tax Credit affect your result?",
      "Reflection: Reflect on what you've learned. Write down three key takeaways from this project and how you'll apply this knowledge in your future adult life.",
      "Presentation: Create a PowerPoint presentation summarizing your journey through the Tax-scape Adventure. Use your humor, creativity, and personal touch to make it engaging."
    ]
  },
  {
    "Project objective": "Welcome to the magical kingdom of \"Taxtopia\"! You are a 30-year-old dragon trainer (yes, they're real in this world!). You have a 5-year-old child, a dependent grandparent, and you're saving up for a nice little cottage by the seaside. You also volunteer and donate to the \"Keep Dragons Flying\" charity. Since dragon training can be a little messy, you've set up a home office. It's tax season in Taxtopia and you're on a quest to discover what tax credits and deductions you're eligible for.",
    "Steps": [
      "Beginning of the quest: Start by understanding the basics of credits and deductions. Write a brief summary explaining the difference between the two.",
      "Child and Dependent Care Credit: Research what the Child and Dependent Care Credit is and its eligibility requirements. Based on your child and grandparent's situation, determine if you qualify.",
      "Medical expenses deductions: Learn about what medical expenses can be deducted. Assume you've spent some gold coins on dragon-burn ointments and health potions. Determine if these costs are deductible.",
      "Charitable donations: Understand how donations to charities like \"Keep Dragons Flying\" can be deducted from your taxable income. Calculate the potential deduction from your annual contribution.",
      "Home office deductions: Research home office deductions. Given your home office setup for dragon training, calculate what portion of your home expenses (like rent and utilities) could be deducted.",
      "Filing your mock tax return: With your newfound knowledge, complete a mock tax return using a free online tax software. Use imaginative yet plausible numbers for income and expenses.",
      "Analysis: Analyze your mock tax return. Write a short report explaining your total tax liability and how the credits and deductions affected your tax return.",
      "Reflection: Reflect on your quest. Write down three key lessons you've learned about taxes and how you plan to apply this knowledge when you're an actual adult.",
      "Present your journey: Create a comic strip or storyboard detailing your Tax Trek through the land of deductions and credits. Inject humor and creativity to make your journey engaging and entertaining."
    ]
  },
  {
    "Project objective": "Welcome to the town of \"Taxville\", where you're a recent high school graduate turned professional UFO hunter (it's a real job in Taxville!). You've moved to a different city for your new job, taken out student loans for your UFOlogy course, made energy-efficient improvements to your rented spaceship, and paid a tax consultant (who happens to be an alien with a knack for intergalactic tax laws) to help you with your taxes. Your mission? Find out what tax deductions you're eligible for in your quest to save the universe (and your wallet!).",
    "Steps": [
      "Launchpad: Start by researching the basics of tax deductions. Write a paragraph describing what tax deductions are and how they can impact your taxable income.",
      "Job search expenses: Discover what job search expenses can be deducted. Given your recent job hunt for the perfect UFO hunting gig, figure out what expenses you could potentially deduct.",
      "Moving expenses for a new job: Research moving expense deductions related to a new job. Given your inter-city move for your UFO hunting job, calculate what portion of those expenses you could deduct.",
      "Energy-efficient home improvements: Explore what energy-efficient improvements can be deducted. Given that you've recently upgraded your spaceship to be more energy-efficient, figure out what deductions you may qualify for.",
      "Tax preparation deductions: Investigate if your alien tax consultant's fees are deductible. Calculate the potential savings from this deduction.",
      "Filing your mock tax return: Using your researched deductions and an online tax software, fill out a hypothetical tax return. Be creative with your income and expense figures, but keep them reasonable.",
      "Analysis: Analyze your hypothetical tax return. Write a summary explaining how each of the deductions impacted your tax liability.",
      "Reflection: Reflect on your journey. What surprised you the most about the tax deductions you found? Write a brief reflection on what you've learned about taxes and how they could impact your future financial decisions."
    ]
  }
]