[
  {
    "Project objective": "Internet Safety",
    "Steps": [
      "Start by researching the basics of internet safety. Find reputable resources online that cover topics like privacy settings, strong passwords, the importance of not sharing personal information, phishing, and cyberbullying.",
      "Look for recent news stories about internet safety breaches. Read the stories, summarize them, and analyze what went wrong and how it could have been prevented.",
      "Create a list of unsafe internet behaviors, explaining why each behavior is risky.",
      "You've received an email from an unknown sender, claiming to be a long-lost relative who's left you a fortune. Craft a detailed response discussing why this could be a scam, what steps you would take to confirm its legitimacy, and what actions you would take if it is indeed a scam.",
      "Research best practices for creating strong passwords. Then, devise an algorithm for creating secure passwords that are also memorable.",
      "Research about cyberbullying. How does it occur, and what are its effects? Develop a plan on how you would support a friend who is being cyberbullied.",
      "Imagine you've been hired as a social media consultant for a famous celebrity who needs advice on maintaining their online privacy. Write a list of guidelines and recommendations on how they can use social media safely and responsibly.",
      "Explore the concept of digital citizenship. How should one behave online? Create a \"Digital Citizenship Pledge\" detailing the actions you will take to be a responsible internet user.",
      "Look into online privacy rights and laws in your country. Write a summary of your rights as a digital citizen and why they're important.",
      "Compile your findings, scenarios, and pledges into a comprehensive Internet Safety Guide. This could be a document, a website, or a slideshow presentation. Your guide should be informative, engaging, and easy for other teens to understand."
    ]
  }
]