[
  {
    "Project objective": "Dance it Out – A Journey of Self-Expression Through Contemporary Dance",
    "Steps": [
      "Listen to a variety of music genres. While doing so, allow your body to move freely to the rhythm. No choreographed moves, just spontaneous motion. Remember, this is an exercise in improvisation!",
      "Identify different spaces around your home where you can dance. Be mindful of your movements within these spaces. Try to explore as much of the space as possible during your dance, be it your bedroom, living room, or even kitchen.",
      "Try dancing to the same song at different speeds. How does it feel to move faster or slower? Understand how time can affect your dancing style.",
      "Dance like nobody's watching! Release your energy and let it flow through your movements. Notice how different levels of energy affect your performance.",
      "Record a dance where you incorporate your newfound understanding of body awareness, improvisation, space, time, and energy. This does not need to be a planned choreography - let your body lead you.",
      "Review your recorded dance. Write down your observations and thoughts. Did you manage to express all the concepts?",
      "Based on the feedback you received and your personal reflections, revisit your dance. Are there parts where you can express a concept better? If yes, revise and re-record.",
      "Organize a virtual dance-off with your friends where everyone shares their dance videos. Enjoy the variety of interpretations and celebrate your journey of self-expression through contemporary dance!"
    ]
  },
  {
    "Project objective": "Let's Dance - A Story of Expression and Movement",
    "Steps": [
      "Using the internet, research basic contemporary dance moves, focusing on floor work. Practice these moves ensuring you are aware of your body alignment.",
      "Learn about the principles of Contact Improvisation. Practice some basic moves with a partner, making sure to communicate effectively and respect each other's boundaries.",
      "Draw or write down a rough plan of your choreography. Decide which parts of your story each dance move will express.",
      "Once you feel comfortable with the choreography, record your dance. This can be done using a smartphone or a camera.",
      "Watch your recorded dance and note down your observations. Did your choreography successfully express your chosen story or emotion?",
      "Based on the feedback you received, refine your dance. This could involve improving your alignment, making your expression clearer, or adjusting your choreography.",
      "Host a virtual dance party where you and your friends perform your choreographies. Celebrate each other's creativity and hard work!",
      "A device with a camera for recording, access to online dance resources, safe space for dancing, a dance partner for practicing contact improvisation (optional)."
    ]
  },
  {
    "Project objective": "Dance Mania - Technique, Composition, and More!",
    "Steps": [
      "Explore the specific techniques involved in your chosen dance style. This can be done by following online tutorials or guides.",
      "Find a group of friends who are also interested in the project. The group could be formed virtually if necessary. Each group member should choose a role (like choreographer, dancer, etc).",
      "As a group, compose a dance routine in your chosen style. Use your knowledge of the style's technique to make your composition authentic.",
      "Begin practicing your routine, focusing on perfecting the technique and synchronizing as a group.",
      "Every dance style has a unique aesthetic. As a group, create costumes and gather props that reflect your chosen style.",
      "Once your routine is polished and your costumes are ready, rehearse the performance. This includes entering, performing, and exiting the stage.",
      "Have a friend or family member record your group performance. Make sure they capture all the amazing details!",
      "Watch the recorded performance as a group. Discuss what worked well and what could be improved. Each member can offer constructive feedback.",
      "Organize a virtual event where all groups can share their performances. It's a fun way to learn about different dance styles and to appreciate each other's hard work."
    ]
  }
]