[
  {
    "Project objective": "Bust a Move: A Virtual Dance-off Competition",
    "Steps": [
      "Pick a Pop: Start by researching the dance style Popping. Find out its history, notable dancers, and specific moves.",
      "Love for Locking: Explore the dance style Locking. Note down its origin, key elements, and impact on street dance culture.",
      "Break it Down: Discover the roots and importance of Breaking in street dance. What are its key moves and how has it influenced other dance styles?",
      "Boogie to Boogaloo: Unearth the origins and impact of Boogaloo. What makes it unique, and why is it important in the realm of street dance?",
      "Krump it up: Investigate the history and significance of Krumping. Understand its distinctive elements and the cultural context from which it emerged.",
      "Plan the Event: Now that you have gathered all your research, it's time to start planning the virtual dance-off. How will the event run? Will there be a theme? How will you incorporate the different dance styles into the event?",
      "Recruitment: Reach out to potential participants. Can they represent one of the styles you've researched? Encourage them to incorporate moves from those styles in their routines.",
      "Educational Materials: Create simple, easy-to-understand materials that explain each dance style to the audience. These can be presented as slides, videos, or infographics.",
      "Event Promotion: Develop a plan to promote your virtual dance-off. This could include creating flyers, social media posts, and word-of-mouth marketing.",
      "Hosting the Event: Finally, it's the day of the event! Facilitate the competition, introduce each dance style to the audience using your educational materials, and make sure everyone has a great time."
    ]
  },
  {
    "Project objective": "Dance Lab: Explore, Experiment, and Exhibit",
    "Steps": [
      "Freestyling Free-for-All: Begin by researching Freestyling. Learn about its origins, different styles, and significance in the world of dance.",
      "Tut, Tut, Tutting: Unearth the fascinating world of Tutting. Discover its history, characteristics, and influence on popular culture.",
      "Up Rock and Roll: Investigate Up Rock. Note down its distinctive moves, origins, and role within the dance community.",
      "Down with the Rock: Understand the essence of Down Rock. Explore its history, main moves, and how it differs from Up Rock.",
      "Powering Through: Dive into Power Moves. What makes them unique? How have they shaped the trajectory of street dance?",
      "Planning the Exhibit: With your research in hand, start brainstorming on how you can translate this information into an engaging, interactive exhibit. Will there be dance demonstrations? Interactive dance lessons? Multimedia presentations?",
      "Design the Exhibit: Sketch out a rough floor plan of your exhibit. Decide where each dance style will be featured, how the information will be presented, and where interactive elements will be located.",
      "Prepare Demonstrations: Create a series of short dance routines or demonstrations for each style, showcasing the key moves you have researched. If possible, film these demonstrations for online viewers.",
      "Promote the Exhibit: Design and distribute flyers both online and around school. Make sure to highlight the interactive aspects of the exhibit to attract attendees.",
      "Dance Lab Day: Finally, it's time to run the exhibit! Keep things energetic and interactive. Remember, your goal is not just to show these dance styles, but to get your peers involved and interested in them."
    ]
  }
]