[
  {
    "Project objective": "You wake up to a strange email in your inbox. It's an SOS from a world-renowned salsa dancer - their groove has mysteriously vanished and they can't dance anymore! They've heard about your budding salsa skills and believe only you can solve this mystery. Your mission, should you choose to accept it, is to find the missing groove and save salsa!",
    "Steps": [
      "Focus on the Open Break. The Open Break is a fun and dynamic move - could the missing groove be hiding there? Post a video of your Open Break online, asking your followers if they've seen the groove.",
      "The plot thickens! Your dance followers point you towards the 'Inside Turn'. Could the groove have gotten lost in the spin? Share a video of your Inside Turn and see if your followers spot any signs of the groove.",
      "Just when you think you're close, a new twist! You need to investigate the 'Outside Turn'. Upload a video of you doing the Outside Turn. Can your followers spot the groove yet?",
      "One of your followers sends you a coded message. It says, \"Turn inside, then out - the groove is about!\". What could this mean? Ponder over it while you practice your inside and outside turns again.",
      "Now that you've found the missing groove, it's time to show it to the world. Film a seamless salsa sequence including all the moves you've learned, and share it online.",
      "Congratulations, detective! You've found the missing groove. Your video goes viral, and the salsa dancer thanks you profusely. You saved salsa! Celebrate by having a virtual dance party with your followers. After all, the groove is meant to be shared!"
    ]
  },
  {
    "Project objective": "You open your email one morning to find a mysterious letter, complete with an old-timey wax seal. It's an invitation to a secret salsa society, but you must prove your worth to join. The first test? Mastering the Hammerlock Position!",
    "Steps": [
      "A follower comments on your post with a cryptic message: \"The Copa is the key\". To solve the mystery, you need to learn the Copa. Once you've got it down, post a video of your new moves with the hashtag #CopaCodex.",
      "Your followers are loving your salsa journey, but some point out that your spins could use some work. Time to master Spotting, a technique to help with balance and focus during turns. Show off your spotting skills in a new video.",
      "After mastering these skills, you're feeling pretty confident. But how do they all fit together? Spend some time integrating all these moves - Hammerlock Position, Copa, Suzy Q, Spotting, and Syncopation into one dance routine.",
      "You receive one last mysterious message: \"Welcome to the Salsa Cipher\". You did it! You proved your worth, and now you're part of the secret salsa society! Celebrate by hosting a virtual salsa party with your new society members."
    ]
  },
  {
    "Project objective": "The Dancing Detective - Solving the Salsa Syndicate's Enigma",
    "Steps": [
      "A comment on your post reads: \"Your quest has begun, but remember, timing is everything.\" Learn the importance of Timing in salsa dance and create a video demonstrating your understanding. Use the hashtag #SalsaTimingTruth.",
      "Another comment catches your attention: \"Styling isn't just for looks. It holds the next key\". Learn about Styling in salsa and show off your personalized style in your next dance video.",
      "The notes of salsa music contain secrets only your ears can decode. Study Musicality in salsa and express the rhythm and melody in your dance. Share your video with the caption, \"Unraveling the #MusicalityMystery\".",
      "The last clue comes in a direct message: \"The salsa syndicate's secret lies in the connection between two.\" Learn about Partner Connection and its importance in salsa dance.",
      "Find a dance partner - a friend, family member, or even a pet can work. Practice your Partner Connection with them and film your best salsa routine demonstrating it.",
      "Using all the clues and moves you've learned (Hand Toss, Timing, Styling, Musicality, and Partner Connection), craft a salsa dance routine. The routine is your cipher to solving the salsa mystery!",
      "Post a video of your complete dance routine on your social media platform. Ask your followers if they can decipher the 'code' in your salsa routine."
    ]
  }
]