[
  {
    "Project objective": "Welcome to the Ballroom!",
    "Steps": [
      "Start your project by diving into the history and evolution of ballroom dance. Gather general information and note down the unique characteristics of this dance form. This includes the role of frame in leading and controlling movements.",
      "All About the Frame: Understand the concept of 'Frame' in ballroom dance. It's not just about how you stand, it's about how you move together! Watch online tutorials or read articles explaining its importance. Attempt to practice the frame stance with a partner or even a broomstick!",
      "Lead and Follow Game: Play a game of 'Simon Says' with a friend or family member. One person is the 'lead' (Simon), and the other is the 'follow'. The 'lead' performs a movement, and the 'follow' must mimic it. This will help you understand the principle of 'Lead and Follow' in ballroom dance.",
      "Tick-Tock Timing: Watch ballroom dance videos and pay close attention to the dancers' timing with the music. Try clapping along with the beats to get a feel of the rhythm and timing.",
      "Feet, Don’t Fail Me Now: Examine the importance of footwork in ballroom dancing. Try to practice basic footwork patterns of a simple dance like the Waltz or Cha Cha. Remember, good dance shoes can be your best friends!",
      "Getting into Rhythm: Listen to some classic ballroom dance music pieces. Try to identify the rhythm and how it differs from timing. A good exercise can be to tap your feet or snap your fingers along with the rhythm.",
      "Record and Reflect: Record your dance routine and watch it. Pay attention to your frame, the lead and follow dynamics, your timing with the music, rhythm and footwork. Make a list of things you think you did well, and things you can improve on.",
      "Refine Your Routine: Based on your observations, refine your dance routine. Practice it a few more times focusing on the areas of improvement.",
      "Final Dance Off: Organize a 'Zoom Dance Off' with your classmates. Everyone performs their routines, and you all can provide constructive feedback to each other. Celebrate the fact that you've all learned something new and had fun doing it. The crown of 'Ballroom Master' goes to everyone who participated and learned!"
    ]
  },
  {
    "Project objective": "Ballroom Blitz: Stand Tall, Dance Right!",
    "Steps": [
      "Posture Examination: Record yourself standing normally, then standing in the dance posture you've learned. Compare the two. What changes do you notice? How does your body feel different?",
      "The Etiquette Tango: Next, investigate dance etiquette. This is not just about being polite - it's about making sure everyone on the dance floor can enjoy themselves safely and comfortably. Create a \"Dance Etiquette Handbook\" based on your findings.",
      "Manners Matter: Organize a video conference with your friends and enact a small skit showing the importance of dance etiquette. This could include scenes like how to politely ask someone to dance, how to maintain appropriate space, etc.",
      "Position Perfect: Look into the various dance positions in ballroom dance - Standard, Latin, etc. Learn about where you and your partner's hands and bodies should be positioned in each. Use a soft toy as a 'dance partner' to practice!",
      "Dance Party: Organize an online 'Ballroom Blitz' with your classmates where everyone shares and performs their routines. Make sure everyone observes the dance etiquette during this fun event. The title of 'Etiquette Champion' goes to the person who best embodies the spirit of dance etiquette!"
    ]
  },
  {
    "Project objective": "Musical Pivot: Mastering the Art of Ballroom Dance Movement",
    "Steps": [
      "Musicality Mastery: Start by understanding musicality in ballroom dance. Watch videos and read articles on how to dance to the rhythm and melody of the music. Find a catchy ballroom dance song and listen to it, focusing on its rhythm, tempo, and melody.",
      "Make Your Own Beats: Try to create a simple rhythmic pattern using a music software or a virtual drum. Does this deepen your understanding of rhythm?",
      "Line of Dance Discovery: Research the term \"Line of Dance\". Understand how it impacts movement on the dance floor. Draw a diagram of a dance floor and mark the Line of Dance. Bonus point if you make it colorful!",
      "Walk the Line: Pretend your house is a giant dance floor and practice moving along the Line of Dance. Don't bump into the furniture, though!",
      "Balance Basics: Now, let's explore the concept of balance in dance. Learn some basic exercises to improve your balance, such as standing on one foot or walking heel to toe.",
      "Connection Creation: The connection between dance partners is a crucial part of ballroom dancing. Explore this concept and think about how you can establish a good connection in a dance. Write a short essay about it.",
      "Connecting the Dots: Now, let's put it all together. Choreograph a short dance routine that includes pivoting, follows the Line of Dance, and requires you to maintain good balance. Of course, remember to dance to the rhythm of your chosen music!",
      "Record Your Rhythm: Record a video of yourself performing your routine. Pay attention to your musicality, Line of Dance, balance, pivots, and your imaginary connection with a partner. Are you satisfied with your performance?",
      "Dance-Off Time: Host an online dance-off where you and your classmates perform your routines and give each other constructive feedback. Maybe even invite your family to watch and vote for their favorite performance!"
    ]
  }
]