[
  {
    "Project objective": "World History - Origins to 1700's",
    "Steps": [
      "Begin by researching a broad overview of human history up to the 1700s. Identify key periods such as the Stone Age, Bronze Age, Iron Age, and the Middle Ages, and understand their characteristics and significance.",
      "Choose five different civilizations from five different eras prior to the 1700s. Write a brief summary for each, outlining their location, time period, key achievements, and reasons for decline.",
      "Select one of these civilizations and research it in-depth. Identify primary sources related to this civilization, such as artifacts, writings, or art, and analyze what these tell you about the culture and lifestyle of the people.",
      "Hypothetical Scenario #1: Imagine you are a member of the civilization you selected. Write a series of diary entries describing your daily life, the challenges you face, the festivities you celebrate, and the traditions you uphold.",
      "Identify three significant technological or scientific advancements made before the 1700s. Discuss how these developments came about and their impact on human civilization.",
      "Select a major global event that occurred before the 1700s, such as a war, migration, or trade expansion. Research this event in depth and write an essay explaining its causes, effects, and long-term impacts.",
      "Hypothetical Scenario #2: Picture yourself as a ruler of a kingdom during a major event you selected in the previous step. Write a letter to your successor, offering advice on how to lead effectively in the wake of this event.",
      "Study the changing world map from human origins to the 1700s. Using online mapping tools, create a series of maps that highlight the rise and fall of major civilizations and empires.",
      "Reflect on how events, developments, and figures from the origins to the 1700s have shaped the world we live in today. Write a one-page reflection discussing your thoughts.",
      "Compile your research, diary entries, letter, maps, and reflection into a digital portfolio. This could be a website, a digital booklet, or a video presentation."
    ]
  }
]