[
  {
    "Project objective": "World History during the 1800s",
    "Steps": [
      "Begin with a general overview of the world in the 1800s. Look at the major powers at the time, the state of technology, the major conflicts, and changes in society and culture.",
      "Select one major event or development from each of the six inhabited continents (Africa, Asia, Europe, North America, Australia, South America) during the 1800s. Write a brief overview of each event, why it happened, who was involved, and its immediate impact.",
      "Choose one of these events and dive deeper. Find primary sources from the period and use them to understand different perspectives on this event. These sources can include letters, newspaper articles, or diary entries.",
      "Hypothetical Scenario #1: Imagine you are a local living during the time of the event you've been researching. Write a series of diary entries discussing your experiences and feelings about the ongoing events.",
      "Identify three significant inventions or scientific breakthroughs of the 1800s. Write a report discussing their development and the impact they had on society and the world.",
      "Look into cultural and social developments during this century. Choose one significant social movement and describe its origins, key figures, and long-term effects.",
      "Hypothetical Scenario #2: Envision yourself as a political leader during a significant turning point in the 1800s. Write a speech addressing your constituents about the change, its implications, and how you plan to lead through it.",
      "Examine the geopolitical shifts of the 1800s. How did borders change? How did power dynamics shift between nations? Use an online tool to create a visual representation of these changes.",
      "Reflect on how the 1800s shaped the world as we know it today. Write an essay discussing the long-term effects of this century's events, developments, and figures.",
      "Compile all of your findings, writings, and visuals into a digital presentation. You can create a video, a slideshow, or a website that highlights all you've learned about the 1800s."
    ]
  }
]