[
  {
    "Project objective": "World History during the 1900s:",
    "Steps": [
      "Start your project with a broad overview of the 1900s. Notice major global events, changes in politics, society, culture, technology, and key figures who influenced this century.",
      "Select four significant events from different periods of the 1900s: early (1900-1925), middle (1926-1950), post-war (1951-1975), and late (1976-2000). Write a short summary for each, explaining what happened, who was involved, and why it was significant.",
      "Choose one of these events and find at least three primary sources related to it. This could include newspaper articles, diary entries, photographs, or political cartoons from the time. Analyse these sources and discuss how they provide different perspectives on the event.",
      "Hypothetical Scenario #1: Pretend you're a time-traveling journalist from You've been transported back to witness the event you selected. Write a front-page newspaper article reporting on the event as it unfolds. Make sure to include quotes from the key figures you might have \"interviewed\".",
      "Explore the significant technological advancements made during the 1900s. Choose one that you think had a major impact on the world and research more about it - its development, the people behind it, and its influence on society.",
      "Pick a cultural shift or social movement that occurred during the 1900s. Write an essay explaining what it was, why it happened, and its effects on society and the world at large.",
      "Hypothetical Scenario #2: Imagine you're a famous author in the 1900s who's been inspired by the social movement you researched. Outline a plot for a novel based on this movement. Include your main characters, their motivations, and the challenges they face.",
      "Explore the changing world map during the 1900s. Take note of significant geopolitical changes such as the dissolution of empires, the formation of new countries, and shifts in political ideologies. Create a before-and-after map using online tools to visually represent these changes.",
      "Reflect on the impact of the 1900s on our present world. Write a reflection on how events, changes, and figures from this era continue to influence our lives today.",
      "For the final step, create a digital presentation summarizing your findings, your newspaper article, novel outline, and your maps. This could be a slideshow, a website, or a video, summarizing what you've learned about the 1900s.",
      "Through this project, you'll get a closer look at the complex and fascinating history of the 1900s, understanding its impact on the world we live in today."
    ]
  }
]