[
  {
    "Project objective": "Learn about pipes and fittings, water supply systems, drainage systems, ventilation systems, and fixture installation by creating a small-scale, functional plumbing system in a hypothetical playground.",
    "Steps": [
      "Research the different types of pipes and fittings commonly used in plumbing systems. Understand their functions, materials, and compatibility with various plumbing applications.",
      "Learn about the key elements and design considerations of drainage systems, such as pipe slope, cleanouts, and traps. Understand how to create a functional and sanitary drainage system that prevents backflow and blockages.",
      "Investigate the role of ventilation systems in plumbing, including air admittance valves and vent stacks. Discover how proper ventilation can prevent vacuum locks and maintain water seal integrity.",
      "Equipment needed: PVC pipes and fittings, pipe cutter, pipe wrench, pipe thread sealant, Teflon tape, measuring tape, computer, internet access, and safety gear (gloves, goggles, etc.)",
      "Create a scaled blueprint of a hypothetical playground's plumbing system, incorporating a water supply system, drainage system, and ventilation system. Include the installation of various fixtures, such as water fountains, restrooms, and an outdoor shower.",
      "Compile a list of necessary pipes, fittings, fixtures, and tools required for your plumbing project. Purchase or borrow these items from local hardware stores or plumbing suppliers.",
      "Following your blueprint, assemble your playground's small-scale plumbing system using PVC pipes, fittings, and fixtures. Apply your knowledge of water supply systems, drainage systems, ventilation systems, and fixture installation to create a functional and safe plumbing system.",
      "Once your plumbing system is assembled, test its functionality by simulating water flow through the pipes and fixtures. Identify any leaks, blockages, or other issues, and apply your plumbing knowledge to troubleshoot and resolve them.",
      "Document your plumbing project through photos, videos, or a detailed report. Share your work with classmates, friends, or family members and discuss the challenges and successes you experienced during the project. Reflect on your growth as a budding plumber and consider how you can apply your newfound skills in real-life situations or future projects."
    ]
  },
  {
    "Project objective": "Learn about water heaters, plumbing codes and regulations, pipe materials, valves, joints, and connections by designing and building a small-scale, DIY outdoor spa.",
    "Steps": [
      "Research different types of water heaters, such as tankless, storage tank, and solar-powered models. Understand their advantages, disadvantages, and ideal applications for each type.",
      "Learn about various pipe materials commonly used in plumbing systems, such as copper, PVC, and PEX. Understand their properties, benefits, drawbacks, and compatibility with different plumbing applications.",
      "Investigate the different types of valves used in plumbing systems, including ball valves, gate valves, and check valves. Discover their purposes, functions, and proper installation methods.",
      "Equipment needed: Small water heater, pipes (appropriate material), pipe cutter, pipe wrench, valves, joints and connectors, measuring tape, computer, internet access, and safety gear (gloves, goggles, etc.)",
      "Create a blueprint for your cozy DIY outdoor spa, incorporating a small water heater, piping system, valves, and fixtures like a showerhead or small tub. Ensure your design complies with local plumbing codes and regulations.",
      "Compile a list of necessary materials, including a water heater, pipes, valves, joints, connectors, and fixtures. Purchase or borrow these items from local hardware stores or plumbing suppliers.",
      "Following your blueprint, assemble the plumbing system for your outdoor spa. Apply your knowledge of water heaters, pipe materials, valves, joints, and connections to create a functional and code-compliant system.",
      "Once your outdoor spa is complete, test its functionality by running hot water through the system and using the installed fixtures. Identify any issues, such as leaks or temperature inconsistencies, and apply your plumbing knowledge to troubleshoot and resolve them.",
      "Document your outdoor spa project through photos, videos, or a detailed report. Share your work with friends, family members, or classmates and discuss the techniques you used to build your cozy retreat. Reflect on your growth as an aspiring plumber and consider how you can apply your newfound skills in real-life situations or future projects."
    ]
  },
  {
    "Project objective": "Learn about water pressure, leak detection and repair, preventive maintenance, sewer lines and septic systems, and plumbing tools and equipment by creating a neighborhood plumbing rescue squad to help locals with their plumbing issues.",
    "Steps": [
      "Research the concept of water pressure and how it influences the performance of plumbing systems. Learn how to measure water pressure and identify potential causes of low or high water pressure.",
      "Learn about the importance of preventive maintenance in plumbing systems, including routine inspections, cleaning, and component replacement. Understand how regular maintenance can extend the life of plumbing systems and prevent costly repairs.",
      "Investigate the differences between sewer lines and septic systems, including their components, functions, and maintenance requirements. Learn how to troubleshoot common issues, such as clogs and backups.",
      "Familiarize yourself with essential plumbing tools and equipment, such as pipe wrenches, plunger, pipe cutter, and auger. Understand their uses and proper handling techniques.",
      "Equipment needed: Computer, internet access, various plumbing tools (pipe wrench, plunger, pipe cutter, etc.), safety gear (gloves, goggles, etc.), and access to plumbing systems for practice.",
      "Gather a group of friends or classmates who are interested in learning about plumbing and helping others. Assign roles based on each person's strengths and interests, such as leak detection expert, water pressure specialist, or sewer line investigator.",
      "Create flyers or social media posts advertising your Pipe Patrol's free plumbing assistance for neighbors. Explain that you're a group of students looking to apply your plumbing knowledge while helping others with minor plumbing issues.",
      "Visit the homes of neighbors who have requested your help and assess their plumbing issues. Apply your knowledge of water pressure, leak detection and repair, preventive maintenance, sewer lines and septic systems, and plumbing tools to diagnose and resolve their problems.",
      "Capture photos, videos, or detailed notes about each plumbing mission, including the issues encountered, the solutions implemented, and any lessons learned throughout the process.",
      "Compile your documentation into a digital gallery, video presentation, or written report. Share your Pipe Patrol adventures with friends, family members, or classmates and discuss the challenges and successes experienced during your missions. Reflect on your growth as an aspiring plumber and consider how you can continue to develop your skills in real-life situations or future projects."
    ]
  }
]