[
  {
    "Project objective": "Educator for a Day: The Time Traveling Teacher",
    "Steps": [
      "Jump back to the Stone Age! Develop a hands-on, active learning lesson about tool making for our early human ancestors.",
      "After delivering your lesson, write a reflection on how you engaged the early humans in active learning. What worked? What didn't?",
      "You're now in Ancient Greece! Develop an inquiry-based lesson that encourages Greek philosophers to question their understanding of the universe.",
      "Reflect on how your inquiry-based lesson was received by the Greek philosophers. Did it stimulate curiosity? Encourage independent thinking?",
      "Differentiated Instruction in the Renaissance",
      "Off to the Renaissance! Leonardo da Vinci needs help learning painting, while Galileo is more interested in physics. Develop a differentiated lesson plan to cater to their unique needs.",
      "Reflect on your Renaissance teaching experience. Did differentiated instruction cater effectively to the learning needs of Leonardo and Galileo?",
      "Project-Based Learning in Industrial Revolution",
      "Zoom to the Industrial Revolution! Design a project-based lesson where your students invent a machine to address a contemporary problem.",
      "Review the projects completed by your Industrial Revolution students. How effective was the project-based approach in promoting deeper understanding?",
      "Cooperative Learning in the 21st Century",
      "Back to the 21st century! Design a cooperative learning lesson for a high school class, where they collaboratively solve a complex math problem.",
      "Cooperative Reflection and Final Thoughts",
      "Reflect on how cooperative learning worked in a modern context. Compile your reflections from all eras into a final report. What insights have you gained about the various teaching strategies?"
    ]
  },
  {
    "Project objective": "Operation TeachBack: The Reverse Classroom",
    "Steps": [
      "Log into the simulation game and get to know your virtual class. Each student has a unique personality and learning style.",
      "Design an interactive quiz using a tool like Kahoot or Quizlet to assess your virtual students' understanding of a chosen topic.",
      "Reflect on the results of the quiz. Did it give you useful information about what your virtual students understand and what they're struggling with?",
      "Now, design a flipped classroom lesson on a new topic. Create a short video lesson or choose an existing one online. Set this as \"homework\" for your virtual students.",
      "Enter the simulation and conduct the in-class portion of your flipped lesson, focusing on active learning activities using the pre-learned material.",
      "Reflect on the flipped classroom experience. What benefits and challenges did you encounter?",
      "Next, create a blended learning module that combines self-paced online learning with collaborative in-person activities in the game.",
      "Running the Blended Learning Module",
      "Run your blended learning module in the simulation. Monitor how your virtual students handle the mix of learning modes.",
      "Now, introduce a real-world problem related to the latest topic. Use problem-based learning to help your students find a solution collaboratively.",
      "Finally, ask your virtual students to create individual projects to demonstrate their understanding. Reflect on your experience using these innovative teaching strategies. Did they enhance your virtual students' learning?"
    ]
  },
  {
    "Project objective": "Climb the Tower of Bloom: A Game-Based Learning Adventure",
    "Steps": [
      "Meet the tower's inhabitants. Each one represents a different subject domain, has forgotten specific knowledge, and learns in a unique way.",
      "Constructivist Learning Theory states that learning is an active process where learners construct new ideas based on their past knowledge. Choose one inhabitant and help them rediscover a forgotten concept based on what they still remember.",
      "Take an online learning style inventory (like the VA model) to identify your own learning style.",
      "Now it's time to gamify the learning process! Create a simple online game (you can use platforms like Kahoot!) for another inhabitant that caters to their learning style.",
      "Run your game with the inhabitant. Did they remember more after the game? Reflect on the effectiveness of learning through games.",
      "For the third inhabitant, create a set of six questions, each representing a different level of Bloom's Taxonomy: Remember, Understand, Apply, Analyze, Evaluate, and Create.",
      "Ask your Bloom's Taxonomy questions to the third inhabitant. Could they answer them all? How did each question type help the inhabitant understand the topic better?",
      "Reflect on your whole adventure. What worked best? What would you do differently next time? Celebrate your success - you've restored knowledge to the Tower of Bloom!"
    ]
  }
]