[
  {
    "Project objective": "Diesel Demystified: The Ultimate Diesel Engine Survival Guide",
    "Steps": [
      "Research Diesel Basics: Start your journey by understanding the basics of diesel engines. How do they work? What are their main components?",
      "Engine Lubrication System: Research about the engine lubrication system. How does it work? Why is it important? What happens if it fails?",
      "Cooling Systems: Dive into the cooling systems. How do they regulate the engine's temperature? What are the key components of a cooling system?",
      "Electrical Systems: Explore the engine's electrical system. How does it control the engine's operations? What are its major parts?",
      "Fuel Systems and Injection Systems: Understand the fuel systems and injection systems. How do they work together to power a diesel engine?",
      "Create an Outline: Now that you've gathered your information, create an outline for your survival guide. Each section should cover one of the topics you've researched.",
      "Presentation Creation: Turn your research into a visual masterpiece. Make each slide or section of your guide easy to understand, with clear diagrams or relevant pictures. Don't forget to add humor - apocalypse scenarios can always use a little light-heartedness!",
      "Interactive Quizzes: Create a few interactive quizzes after each section to test your classmates' understanding of diesel engines. For instance, a \"Guess the part!\" quiz would be a fun addition.",
      "Video Narration (Optional): For an extra layer of engagement, record a narration for your guide. Roleplay as a mechanic surviving in the post-apocalyptic world, sharing your diesel engine knowledge to ensure survival."
    ]
  },
  {
    "Project objective": "Auto-World Avengers: The Puzzling Pitstop Panic",
    "Steps": [
      "Riddle Deciphering: Each riddle will correspond to one of the above topics. Start by deciphering the riddles to figure out which topics they refer to.",
      "Emissions Control System & Engine Rebuilding: Research these topics to solve the first set of riddles. Understand the importance, function, and key components.",
      "Wheel Alignments & Tires and Wheels: Solve these riddles by understanding the theory behind wheel alignments and the importance of tires and wheels.",
      "Drive Train Systems & Special Tools and Equipment: To solve the final riddles, research these topics. What are the critical components of the drive train system, and what special tools and equipment are essential in a workshop?",
      "Riddle Answers and Solutions: Now that you've deciphered the riddles and researched the answers, put together a presentation that showcases your solutions to each riddle and the corresponding technical fixes.",
      "Interactive Quiz: Create an interactive quiz based on the information you've shared in your presentation. See if your classmates can match the riddles to the correct topics!",
      "Humorous Skits: Add an element of fun to your project by acting out humorous skits or scenarios related to the topics. For example, a comedy sketch on the importance of shop safety or a funny short on the consequences of ignoring preventive maintenance.",
      "Presentation Time: Share your project with the class. Challenge them to the quiz, showcase your skits, and enjoy the ride through the Auto-World Grand Prix! Remember, the race is not always to the swift, but to those who keep on running (or in this case, researching!)."
    ]
  }
]