[
  {
    "Project objective": "Learn about haircutting techniques, hair styling, hair coloring, texturizing services, and scalp and hair care while providing free hair makeovers to members of the community.",
    "Steps": [
      "Learn about various haircutting techniques such as layering, graduation, and point cutting. Watch tutorials and practice on a mannequin head or willing friends and family members to develop your skills.",
      "Research hair coloring techniques like balayage, highlights, lowlights, and all-over color. Practice mixing and applying hair color on a mannequin head or color swatches, following manufacturer's instructions for proper use.",
      "Learn about texturizing services such as perms, relaxers, and keratin treatments. Understand the process, application, and safety precautions associated with each service.",
      "Research the importance of scalp and hair care, including proper shampooing, conditioning, and scalp massage techniques. Learn how to recommend appropriate hair care products based on individual needs.",
      "Equipment needed: Computer, internet access, mannequin head and stand, scissors, combs, brushes, hair styling tools (blow dryer, curling iron, flat iron), hair coloring supplies (color, developer, gloves), texturizing service supplies (perm rods, relaxer, keratin treatment), and hair care products (shampoo, conditioner, styling products).",
      "Plan a community event where you and your classmates will provide free hair makeovers to local residents. Set a date, time, and location for the event, and create promotional materials to spread the word.",
      "Gather all necessary equipment and supplies for the Hair-tastic Makeover event. Ensure you have enough materials to accommodate the number of attendees you expect, and organize your workspace for efficiency and safety.",
      "Recruit classmates or friends who are also interested in cosmetology to join you in providing makeovers at the event. Share your knowledge and skills with your team members, ensuring everyone is prepared to perform the services they will be offering.",
      "On the day of the event, set up your workspace, greet attendees, and provide them with an enjoyable and professional hair makeover experience. Showcase your skills in haircutting, hair styling, hair coloring, texturizing services, and scalp and hair care while making a positive impact on your community."
    ]
  },
  {
    "Project objective": "Learn about nail care and design, skin care and facials, makeup application, hair removal techniques, and salon management while organizing and running a pop-up beauty salon for friends, family, and community members.",
    "Steps": [
      "Research various nail care techniques, including proper filing, shaping, and cuticle care. Learn about popular nail art designs and practice painting them on nail tips or willing volunteers.",
      "Learn about makeup application techniques, including color theory, contouring, and blending. Practice creating different makeup looks on yourself or willing volunteers to develop your skills.",
      "Research various hair removal techniques such as waxing, threading, and sugaring. Understand the benefits and drawbacks of each method, and practice on a small area of skin or a mannequin with artificial hair.",
      "Equipment needed: Computer, internet access, nail care supplies (files, buffers, cuticle pushers, polishes, nail art tools), skin care products (cleansers, exfoliants, masks, moisturizers), makeup products (foundation, concealer, eye shadow, eyeliner, mascara, lipstick), hair removal supplies (wax, wax strips, threading thread, sugar paste), and salon management tools (appointment book or scheduling software, inventory list).",
      "Arrange a suitable space for your pop-up beauty salon, setting up stations for each of the services you'll be offering (nail care, skin care, makeup application, and hair removal). Ensure that you have all necessary equipment and supplies on hand.",
      "Recruit classmates or friends who are also interested in beauty services to join your Glam Squad team. Assign each team member a specific service area based on their interests and skills.",
      "On the day of the event, greet attendees and guide them through the salon experience, ensuring they enjoy a professional and relaxing beauty treatment. Showcase your skills in nail care, skin care, makeup application, and hair removal while demonstrating excellent salon management practices."
    ]
  },
  {
    "Project objective": "Learn about health and safety practices, anatomy and physiology of the hair and skin, professionalism and ethics, client consultation, and the history of cosmetology while creating a series of historically-inspired beauty looks.",
    "Steps": [
      "Research essential health and safety practices in cosmetology, including sanitation, disinfection, and personal protective equipment. Create a checklist to ensure you follow these practices throughout the project.",
      "Learn about professionalism and ethics in the cosmetology industry, including appropriate behavior, attire, and communication. Develop a personal code of conduct to guide your actions throughout the project.",
      "Investigate the history of cosmetology, including key trends, techniques, and influential figures from various time periods (e.g., ancient Egypt, the Renaissance, the 1920s). Select three historical eras that interest you the most.",
      "Equipment needed: Computer, internet access, cosmetology tools and supplies (e.g., makeup, hair styling products, brushes, combs), personal protective equipment (gloves, face mask), and cleaning and disinfecting supplies.",
      "Using your research on the history of cosmetology, create a unique beauty look inspired by each of the three historical eras you selected. Consider elements such as makeup, hairstyles, and accessories.",
      "Develop a presentation that showcases your historically-inspired beauty looks, detailing the techniques, trends, and historical context behind each one. Include images or drawings to illustrate your designs.",
      "Invite friends, family members, and classmates to attend a special event where you will present your historically-inspired beauty looks and share your knowledge of cosmetology history. Set a date, time, and location for the event, and create promotional materials to spread the word.",
      "During the Time-Traveling Cosmetologists event, conduct brief client consultations with attendees to determine which historical beauty look they would like to try. Apply your knowledge of health and safety practices, anatomy and physiology, and professionalism and ethics while recreating the chosen looks on your \"clients.\""
    ]
  }
]