[
  {
    "Project objective": "HVAC Fundamentals: Become familiar with the basics of HVAC. You are now an HVAC rookie, ready to graduate to pro status!",
    "Steps": [
      "Exploration of HVAC Systems: Research different types of HVAC systems and their applications. Now you're getting the hang of it!",
      "Heating System Shenanigans: Learn about various heating systems and their components. This will keep the house warm even when there are chills running down your spine!",
      "Vigilant about Ventilation: Study different types of ventilation systems and their advantages. This is the key to keeping the air in the mansion fresh, despite any ectoplasmic residue.",
      "Acing the Air Conditioning: Master the principles and working of air conditioning systems. This will keep things cool when the paranormal activity heats up.",
      "Mansion Assessment: Virtually assess the current condition of the mansion's HVAC systems. Look for \"paranormal\" inefficiencies, and note down the elements that need a makeover.",
      "Design Time: Now, using your 3D design software, redesign the HVAC system for the mansion. Make sure it's spook-proof!",
      "Project Report: Prepare a report on why you chose the specific systems and how they would improve the mansion's overall comfort and efficiency. Don't forget to mention how it caters to our spectral inhabitants!",
      "Presentation Power: It's showtime! Create a presentation, showcasing your report and 3D model. Let the world see the next star of \"Extreme House Makeover: HVAC Edition.\""
    ]
  },
  {
    "Project objective": "Cool it Down: The Arctic Adventure Dome",
    "Steps": [
      "Understanding the Refrigeration Cycle: Learn about the basic principles of the refrigeration cycle. This will be your foundation in maintaining a chilly atmosphere at the Arctic Adventure Dome.",
      "Ductwork and Air Distribution Design: Dive into the world of ductwork and understand how air distribution plays a crucial role in HVAC systems. You're going to need this to keep every corner of the Dome comfortably cold!",
      "Indoor Air Quality (IAQ) Investigation: Learn about the importance of indoor air quality and how it's affected by various factors. Remember, our park visitors need to feel like they're in the Arctic, not actually be at risk of frostbite!",
      "Energy Efficiency and Conservation: Research ways to enhance energy efficiency and conservation in HVAC systems. The polar bears will thank you!",
      "Automating with HVAC Controls: Get to know HVAC controls and automation systems. This will help maintain the Dome's environment with less manual intervention, freeing you up for the inevitable penguin rescue missions!",
      "Park Blueprints: Familiarize yourself with the Dome's blueprints. Identify key areas that will need special attention in terms of heating and cooling.",
      "HVAC Design for the Dome: Based on your newfound knowledge, design an efficient and effective HVAC system for the Arctic Adventure Dome using your 3D design software.",
      "Energy Efficiency Plan: Prepare a comprehensive plan outlining how you plan to ensure energy efficiency and conservation in the Dome. The goal is to keep it cool, not melt the polar ice caps!",
      "Report Preparation: Document your designs, plans, and justifications for your HVAC system in a detailed report. This will serve as your guide during the grand presentation to the park management.",
      "Project Presentation: It's showtime! Present your Arctic Adventure Dome HVAC system to the class, explaining the thought process behind your design, your focus on energy conservation, and how you have prioritized indoor air quality."
    ]
  },
  {
    "Project objective": "Mission Control: Lifesaving HVAC for the Mars Habitat",
    "Steps": [
      "Out of this World Load Calculations: Start by learning about load calculations and how they differ for the Earth and Mars environment. A Martian day, or sol, has different temperature extremes compared to Earth.",
      "HVAC Maintenance and Troubleshooting 101: Next, dive into the world of HVAC maintenance and troubleshooting. Remember, a well-maintained system is a life-sustaining system.",
      "Tools and Equipment for the Red Planet: Get familiar with HVAC tools and equipment, and consider which ones would be essential for your Mars mission.",
      "Interplanetary Safety Standards: Understand the safety and industry standards that apply to HVAC systems, especially those in space!",
      "Career Opportunities Exploration: Research the myriad of career opportunities in HVAC, including those in the aerospace sector.",
      "Mars Habitat Blueprints: Review the blueprints of the Mars Habitat. Identify key areas that require specific attention in terms of heating, ventilation, and cooling.",
      "HVAC Design for Mars: Using your 3D design software, design an efficient and effective HVAC system for the Mars Habitat based on your understanding of load calculations and the Martian environment.",
      "Report Preparation: Document your designs, plans, and justifications for your Martian HVAC system in a detailed report. Include your load calculations and the consideration you've given to safety and industry standards.",
      "Project Presentation: Present your Mars Habitat HVAC system to the class, explaining your design, maintenance, and troubleshooting processes, as well as the career opportunities in HVAC that you've discovered during your research."
    ]
  }
]