[
  {
    "Project objective": "Learn about aperture, shutter speed, ISO, depth of field, and composition while participating in a photography scavenger hunt that challenges you to capture creative and captivating images.",
    "Steps": [
      "Research the concept of aperture, including how it affects exposure and depth of field. Practice adjusting the aperture on your camera to achieve different effects in your photos.",
      "Learn about shutter speed and its impact on motion blur and image sharpness. Experiment with various shutter speeds to capture both fast-moving subjects and long exposure shots.",
      "Learn about depth of field and how it can be used to emphasize or de-emphasize elements in your photos. Experiment with different aperture settings and focal lengths to create images with varying depth of field.",
      "Equipment needed: Camera (DSLR, mirrorless, or advanced point-and-shoot), computer, internet access, tripod (optional), and photo editing software.",
      "Develop a list of 10-15 prompts or themes for your photography scavenger hunt, such as \"a colorful door,\" \"shadows at play,\" or \"an interesting reflection.\" Include a variety of subjects and challenges that will require you to apply your knowledge of aperture, shutter speed, ISO, depth of field, and composition.",
      "Choose a location or series of locations where you can find the subjects for your photography scavenger hunt. Plan a route and schedule that allows you enough time to explore and capture each prompt on your list.",
      "Grab your camera and head out on your scavenger hunt, using your creativity and technical skills to capture images that fulfill each prompt. Remember to adjust your aperture, shutter speed, ISO, and composition as needed to create stunning photographs.",
      "Import your photos onto your computer and use photo editing software to make any necessary adjustments, such as cropping, color correction, or exposure tweaks. Select the best image for each prompt and create a digital gallery or physical album showcasing your scavenger hunt adventure.",
      "Invite friends, family members, or classmates to view your photography scavenger hunt gallery or album. Gather feedback on your images and discuss the techniques you used to capture them. Reflect on your growth as a photographer throughout the project and consider how you can continue to develop your skills in the future."
    ]
  },
  {
    "Project objective": "Learn about the rule of thirds, white balance, lighting techniques, focal length, and exposure triangle by creating a series of photographs inspired by iconic movie scenes.",
    "Steps": [
      "Research the rule of thirds and its application in photography. Learn how to use this compositional guideline to create visually balanced images that engage the viewer's eye.",
      "Learn about different lighting techniques used in photography, such as natural light, artificial light, and the use of reflectors. Experiment with these techniques to create interesting and dramatic effects in your photos.",
      "Investigate the concept of focal length and how it impacts the perspective and depth of field in your images. Practice using different focal lengths to capture a variety of photographic styles and effects.",
      "Equipment needed: Camera (DSLR, mirrorless, or advanced point-and-shoot), computer, internet access, tripod (optional), and photo editing software.",
      "Develop a plan for each photo shoot, including the location, props, and models (if needed). Consider how you will recreate the lighting, composition, and mood of each iconic movie scene.",
      "Using your knowledge of the rule of thirds, white balance, lighting techniques, focal length, and exposure triangle, capture a series of photographs inspired by each iconic movie scene. Experiment with various camera settings and techniques to create images that evoke the essence of the original scenes.",
      "Import your photos onto your computer and use photo editing software to make any necessary adjustments, such as cropping, color correction, or exposure tweaks. Apply your understanding of white balance and exposure to enhance the overall look and feel of your images.",
      "Create a digital gallery or physical album showcasing your cinematic photographs. Share your work with friends, family members, or classmates and discuss the techniques you used to recreate the iconic movie scenes. Reflect on your growth as a photographer throughout the project and consider how you can continue to develop your skills in the future."
    ]
  },
  {
    "Project objective": "Learn about camera modes, histograms, post-processing, RAW vs JPEG, and framing by embarking on a wildlife photography adventure in your local area.",
    "Steps": [
      "Research various camera modes, such as Manual, Aperture Priority, Shutter Priority, and Program. Understand when to use each mode and how they influence your photography.",
      "Learn about different post-processing techniques, such as cropping, color correction, and exposure adjustments. Familiarize yourself with photo editing software, like Adobe Lightroom or Photoshop.",
      "Investigate the differences between RAW and JPEG file formats, including their advantages and disadvantages. Understand when to use each format and the implications for your photography workflow.",
      "Explore the concept of framing in photography and how it can enhance your images. Learn various framing techniques, such as using natural frames, leading lines, and filling the frame.",
      "Equipment needed: Camera (DSLR, mirrorless, or advanced point-and-shoot), computer, internet access, tripod (optional), and photo editing software.",
      "Develop a plan for your wildlife photography adventure, including the locations, timing, and equipment needed for each photo session. Consider how you will utilize camera modes, histograms, and framing techniques to capture compelling images of your chosen subjects.",
      "Head out into the wild with your camera and capture a series of photographs featuring your chosen wildlife subjects. Experiment with different camera modes, framing techniques, and exposure settings to create a diverse portfolio of images.",
      "Import your photos onto your computer and use photo editing software to make any necessary adjustments. Apply your knowledge of histograms, RAW vs JPEG, and post-processing techniques to enhance your wildlife images.",
      "Create a digital gallery or physical album showcasing your wildlife photography adventure. Share your work with friends, family members, or classmates and discuss the techniques you used to capture your chosen subjects. Reflect on your growth as a photographer throughout the project and consider how you can continue to develop your skills in the future."
    ]
  }
]