[
  {
    "Project objective": "Build Your Own Miniature 'Robot Wars' Combat Bot",
    "Steps": [
      "Research and prepare a one-page document on welding safety guidelines. Include personal protective equipment (PPE), handling of welding tools, and prevention of common hazards. Print this out and keep it nearby at all times.",
      "Sketch out a design for your combat bot. It should be small enough to fit on the remote-controlled car base, but big enough to showcase your awesome welding skills. Remember to include room for a weapon – a simple, small-scale flipper, spinner, or rammer will do.",
      "Cut out your robot's body pieces using the oxyfuel cutting set. This is your first chance to practice one of the welding techniques you've been studying. Remember to follow your safety guidelines!",
      "Use SMAW to weld together the main body of your robot. This should create a solid shell to protect the remote-controlled car underneath. Remember, perfect welds are not only strong but also look pretty cool!",
      "Create a flipper for your bot. Cut out the pieces with your oxyfuel cutter and use Gas Metal Arc Welding (GMAW) to join them. Be sure to carefully attach it to the main body.",
      "Use GTAW to weld any delicate parts of your robot, such as a spinner weapon or intricate decorations. GTAW is excellent for precise, high-quality welds, making it perfect for these finishing touches.",
      "Once you've assembled your bot, it's time for a test drive. Ensure all the parts are securely welded and the bot is moving as expected. If you find any weak spots or movement issues, go back and reinforce or adjust as necessary.",
      "Give your bot some character! Paint it in bright colors, give it a menacing face, or add any other decorations you want. Just make sure your additions don't interfere with its performance.",
      "Create a video of your bot in action. Show off its movements and weapon, and make sure to highlight the welding techniques you used. Post the video online (with adult supervision and permission) for extra bragging rights.",
      "Write a reflection on the project. What did you learn? What was challenging? What would you do differently next time? Be sure to mention each of the welding techniques you used and how they helped in building your combat bot."
    ]
  },
  {
    "Project objective": "You've recently intercepted some strange signals that you believe to be from extraterrestrial life! The aliens seem friendly, but you need a way to communicate back. Your mission: Build an \"Extraterrestrial Communication Device\" (ECD) out of metal, symbolizing your commitment to interstellar diplomacy. Remember to give it a flashy design – we want to impress our new friends, not scare them off!",
    "Steps": [
      "Prepare the following equipment: Welding safety gear (helmet, gloves, jacket); Plasma Arc Cutting (PAC) machine; Flux-Cored Arc Welding (FCAW) equipment; Assorted metal plates and rods; Welding blueprint software (free options are available online); Paint and decorations (optional)",
      "Compile a list of safety procedures for using the PAC and FCAW equipment. Read it aloud to your pet, your plants, or even a mirror – just make sure you understand and remember it all.",
      "Using your computer, design the ECD. It can be as simple or elaborate as you like, but remember, it should have various types of welding joints and use welding symbols correctly.",
      "Educate yourself about welding symbols and apply them in your design. Create a key for your blueprint that explains what each symbol means.",
      "Use your PAC machine to cut out the pieces of your ECD according to your design. Be sure to follow the safety procedures you reviewed in step 1.",
      "Research different welding positions (like flat, horizontal, vertical, overhead). Practice each one using scrap metal so you'll be ready when it's time to assemble your ECD.",
      "Welding isn't just about fusing two pieces of metal. It's also about knowing which type of joint to use. Learn about the different types of welding joints (like butt, corner, edge, lap, and tee) and incorporate each one in your ECD.",
      "Now it's time to assemble your ECD. Use FCAW to weld the pieces together. Try to apply different welding positions as needed.",
      "Once your ECD is assembled, inspect all your welds. Make sure they're clean and strong. If there are any weak points, go back and reinforce them. After all, you wouldn't want your ECD to fall apart during first contact!",
      "Make your ECD look out-of-this-world! Use paint or any other decorations to make it as attractive to extraterrestrials as possible. (Hint: Aliens are rumored to love bright colors and shiny objects.)",
      "Step 10: Presentation",
      "Create a presentation showcasing your ECD. Include pictures of your project at various stages, an explanation of the welding symbols and joints you used, and a demonstration of the welding positions. And don't forget to share your safety procedures – even aliens care about safety!"
    ]
  },
  {
    "Project objective": "You've been selected as a representative of the human race to create a time capsule that will be sent to the future! To ensure it survives the test of time, it needs to be made of metal and welded with precision. Your mission is to build this time capsule and fill it with items you think will best represent the world of today.",
    "Steps": [
      "Research welding safety procedures and the maintenance required for your equipment. Create a checklist for both and keep it by your workstation at all times.",
      "Before you start, learn about welding metallurgy. Know how different metals interact under heat and pressure, and how that will affect your project.",
      "Sketch your time capsule. Consider the size, shape, and the type of metal you'll use. You'll need to weld it securely to withstand the ravages of time.",
      "Educate yourself on the different types of electrodes and filler metals available. Choose the ones best suited for your project based on your welding metallurgy knowledge.",
      "Before starting on your final piece, practice different welding techniques (like SMAW, GMAW, GTAW, etc.) on scrap metal. You want your time capsule to be perfect, so make sure you've got the techniques down!",
      "Use your welding tools to cut out the pieces of your time capsule. Then, apply your chosen welding techniques to join them together.",
      "Choose items that you think best represent today's world. Remember, future generations (or maybe even future civilizations!) will see these, so choose wisely.",
      "Once your capsule is filled, make the final welds to seal it shut. Make sure it's airtight - we want the contents to be perfectly preserved.",
      "Inspect your welding work. Look for any flaws or weak points that might need reinforcement. Ensure that the quality of your welds is up to par with the standards of the future.",
      "Create a presentation or a blog post about your project. Include your research on welding metallurgy, electrodes, and filler metals. Explain the techniques you used and how you maintained your equipment. Don't forget to include images of your time capsule, both empty and filled, and a brief overview of the items you chose."
    ]
  }
]