[
  {
    "Project objective": "Become the Ambassador: An Exploration of Cultural Sensitivity and Ethics",
    "Steps": [
      "Watch a movie or read a book from a culture different from yours. Reflect on a situation where you empathized with a character. Document this scenario and your feelings.",
      "Practice active listening with a family member or friend. Have them tell you a story, and afterwards, retell it from their perspective. Document the experience, focusing on how it felt to truly hear and understand someone else's story.",
      "Research a culture unfamiliar to you. It could be from anywhere in the world, or even a subculture within your own country. Write a short report about its key values, traditions, and social norms.",
      "Interview someone from the culture you researched. Remember to use your active listening skills. Ask about their experiences, values, and what they wish others knew about their culture.",
      "Write a reflective essay on how learning about a different culture has impacted your self-awareness. Did you discover any biases? How have your viewpoints changed?",
      "Choose an ethical dilemma from recent news or create a hypothetical one. It could be related to politics, environment, technology, etc. Write a short essay on what you believe is the right course of action and why.",
      "Create a personal values statement. What principles guide your actions? How do you wish to impact others?",
      "Ask for feedback from those you interacted with during the project. Were you respectful? Did you listen actively? Were your arguments during the debate well-reasoned and fair? Write a reflection based on this feedback."
    ]
  },
  {
    "Project objective": "The Life of a Social Worker: Juggling Confidentiality, Boundaries, Advocacy, and More",
    "Steps": [
      "Research the principles of confidentiality in social work. Write a code of conduct, including scenarios explaining how you would uphold confidentiality in your virtual practice.",
      "Watch a movie or read a book where professional boundaries are explored or breached. Write a reflection about the importance of maintaining boundaries and how you plan to implement them in Simville.",
      "Access the social simulation game \"Life Balance.\" Take note of your first 5 clients' details (imaginary characters).",
      "Choose one of your clients from the simulation. Research the resources available in Simville that could benefit them. Write a letter advocating for your client to receive these resources.",
      "Review the information of another client. Identify their strengths and develop a plan to leverage these strengths to improve their situation.",
      "For the third client, consider the person-in-environment concept. How do the systems around them (family, school, community, etc.) affect their situation? Write a brief essay on your findings.",
      "Reflect on a situation where you had to maintain confidentiality or professional boundaries in real life. How does this compare to your experience in Simville?",
      "Host an online roundtable discussion with your classmates who are also playing \"Life Balance.\" Discuss your strategies and experiences while maintaining client confidentiality.",
      "Keep a diary of your experiences in Simville for a week. Reflect on your decisions, the effectiveness of your advocacy, how well you maintained boundaries and confidentiality, and how you applied the strengths-based and person-in-environment approaches."
    ]
  },
  {
    "Project objective": "EcoTopia: A Social Justice Adventure in Systems Theory",
    "Steps": [
      "Dive into the concept of social justice. Write an essay describing how you can promote social justice in EcoTopia considering the various systems in place.",
      "Access the EcoTopia simulation and familiarize yourself with its inhabitants and their environment.",
      "Identify a system in EcoTopia (family, school, healthcare, etc.). Assess its current status and how it affects the wellbeing of the inhabitants.",
      "Devise a plan to intervene in the system you assessed to promote social justice. What resources would you need? Who would be involved?",
      "Implement your intervention plan in the EcoTopia simulation. Remember, the system will react to your changes!",
      "Once your intervention is in place, evaluate its effectiveness. Write a report detailing the outcomes and any unexpected consequences.",
      "Finally, reflect on your time as the Director of EcoTopia. How does understanding Systems Theory and promoting social justice impact your view of your community and the world?"
    ]
  }
]