[
  {
    "Project objective": "International Law",
    "Steps": [
      "Create a profile for your Diplomat alter ego. Include their name, homeland, a unique DiplomacyLand pet, and a diplomacy-related superpower (such as the power to resolve any conflict!).",
      "Upon your arrival, you are invited to the Sovereignty Soiree. What is sovereignty? Research about it and write an adventure log about how your character discovered the importance of this concept in DiplomacyLand.",
      "Your character is asked to ascend the Treaty Law Tower. What is treaty law? Research about it and write a story about how your character navigated the tower and the lessons learned.",
      "Your character encounters a riddle based on customary international law. What is it? Research about it and write a comic strip or storyboard showing your character's journey to solve the conundrum.",
      "Your character is invited to the Diplomatic Relations Dance. What are diplomatic relations? Research about it and write a description of the dance and how it symbolizes the concept.",
      "Your character needs to navigate the International Humanitarian Law Labyrinth. What is international humanitarian law? Research about it and write a journal entry detailing your character's journey through the labyrinth.",
      "Create a digital or handmade booklet summarizing the five concepts as a guide for newcomers in DiplomacyLand. Make it colorful, creative, and easy to understand.",
      "Your character participates in DiplomacyLand's Global Forum, discussing the benefits and challenges of these five concepts. Write a speech your character would give, advocating for a change they believe would benefit DiplomacyLand.",
      "Using an online tool like Kahoot or Quizlet, create a quiz about the five concepts. This is the final test for your character to prove their knowledge and commitment to DiplomacyLand's values!",
      "Write a farewell letter from your character to the residents of DiplomacyLand, reflecting on what they've learned during their stay and how they'll apply these lessons in their own world."
    ]
  },
  {
    "Project objective": "International Law",
    "Steps": [
      "Create a profile for your adventurous alter ego. Include their name, homeland, a unique Lawtopia pet, and a law-related superpower (such as the ability to decipher any legal text!).",
      "Your first destination is the Human Rights Hall. What is Human Rights Law? Research about it and write a diary entry detailing your character's experience and learnings in the hall.",
      "The next stop is the Law of the Sea Shore. What is the Law of the Sea? Research about it and write a short story about a maritime adventure your character undertakes, involving this concept.",
      "Your character ventures into the Environmental Law Enclave. What is Environmental Law? Research about it and create a poster or infographic that showcases the key points your character discovered.",
      "Your character must cross the International Criminal Law Isthmus. What is International Criminal Law? Research about it and write a news article about a landmark case your character witnessed in Lawtopia.",
      "Your character braves the Jurisdiction Jungle. What is Jurisdiction? Research about it and write a poem or a song that describes your character's journey through the jungle and the concept of jurisdiction.",
      "Create a digital or handmade booklet summarizing the five legal concepts as a guide for future explorers of Lawtopia. Make it visually appealing, engaging, and informative.",
      "Your character participates in Lawtopia's Grand Assembly, discussing the merits and challenges of these five legal concepts. Write a passionate speech your character would give, advocating for a change they believe would improve Lawtopia.",
      "Using an online tool like Kahoot or Quizlet, create an exam about the five legal concepts. This is the final test to prove your character's commitment and understanding of Lawtopia's principles!",
      "Write a farewell letter from your character to the inhabitants of Lawtopia, reflecting on what they've learned during their voyage and how they'll apply these lessons in their own world."
    ]
  },
  {
    "Project objective": "Journey to the United Nations of Planet Zog",
    "Steps": [
      "Create an ambassador profile for yourself. Include your name, homeland, a unique Zog pet, and a diplomatic superpower (like the ability to instantly translate any language!).",
      "Upon your arrival, you're guided to the Hall of State Responsibility. What is State Responsibility? Research about it and write an adventure log about your character's discovery of this concept.",
      "Next, you head to the Peaceful Settlement of Disputes Dome. What does this mean? Research about it and draft a peace agreement resolving a hypothetical dispute between two Zog nations.",
      "As a representative of Earth, you're asked to navigate the Use of Force Field. What is the law regarding the Use of Force? Research about it and write a short story about your encounter in this field.",
      "Your journey takes you to the International Organizations Orbit. What are international organizations and what do they do? Research about it and create a poster or infographic about an interstellar organization.",
      "To trade with the Zog nations, you need to understand the International Trade Law Labyrinth. What is international trade law? Research about it and write a guide for future Earth ambassadors.",
      "Create a digital or handmade guidebook summarizing the five concepts as a guide for future Earth ambassadors to Planet Zog. Make it visually appealing, engaging, and informative.",
      "You've been asked to speak at Planet Zog's Interstellar Assembly, discussing these five concepts. Write a powerful speech your character would give, advocating for a change they believe would benefit interplanetary relations.",
      "Using an online tool like Kahoot or Quizlet, create a quiz about the five concepts. This is the final test to prove your commitment and understanding of Planet Zog's principles!",
      "Write a farewell letter from your character to the inhabitants of Planet Zog, reflecting on what they've learned during their stay and how they'll apply these lessons back on Earth."
    ]
  }
]