[
  {
    "Project objective": "The Employment Law Detective: Uncovering Workplace Mysteries",
    "Steps": [
      "Create your employment law detective persona: Invent a captivating detective character with a backstory focused on solving mysteries related to employment law and ensuring fair treatment in the workplace.",
      "Investigate minimum wage: Research the concept of minimum wage, including its history, current rates, and the rationale behind it. Compare minimum wage rates across different states and countries.",
      "Uncover overtime pay secrets: Learn about overtime pay regulations, including eligibility, calculation, and exemptions. Develop a hypothetical scenario to practice calculating overtime pay for different work schedules.",
      "Examine child labor laws: Investigate the history and objectives of child labor laws. Explore the restrictions and protections in place for young workers, such as age limits, work hours, and prohibited occupations.",
      "Probe workplace discrimination: Research different forms of workplace discrimination, including those based on race, gender, age, and disability. Understand the legal protections against discrimination and the role of organizations like the Equal Employment Opportunity Commission (EEOC).",
      "Reflect on your Employment Law Detective experience: Write a reflection on your journey uncovering workplace mysteries through The Employment Law Detective project. Share what you've learned and how these concepts apply to real-life work situations."
    ]
  },
  {
    "Project objective": "The Workplace Warriors: Defenders of Employee Rights",
    "Steps": [
      "Create your workplace warrior persona: Invent a powerful superhero character with a backstory focused on defending employee rights and promoting fairness in the workplace.",
      "Master the Family and Medical Leave Act (FMLA): Research the provisions and eligibility requirements of the FMLA, including the types of leave covered and the protections it offers to employees. Understand the responsibilities of employers under this law.",
      "Unravel the mysteries of workers' compensation: Investigate the purpose and scope of workers' compensation, including the types of injuries and illnesses covered, the benefits provided, and the process for filing a claim.",
      "Distinguish between employee and independent contractor: Explore the differences between employees and independent contractors, including their legal rights, tax implications, and the criteria used to determine their classification.",
      "Champion the Equal Pay Act: Study the history and purpose of the Equal Pay Act, which aims to prevent wage discrimination based on gender. Understand the factors that contribute to the gender pay gap and the potential remedies for addressing it.",
      "Defend workplace safety with OSHA: Discover the role of the Occupational Safety and Health Act (OSHA) in protecting workers from workplace hazards. Learn about OSHA standards, inspections, and employer responsibilities.",
      "Embark on a virtual workplace rescue mission: Create several hypothetical workplace scenarios involving issues related to FMLA, workers' compensation, employee classification, equal pay, and OSHA. Use your superhero powers and knowledge of employment law to resolve each situation.",
      "Reflect on your Workplace Warriors experience: Write a reflection on your journey defending employee rights through The Workplace Warriors project. Share what you've learned and how these concepts apply to real-life work situations."
    ]
  },
  {
    "Project objective": "Employment Law",
    "Steps": [
      "Introduce yourself to Laborville by creating a fictional character (it could be an alien, a robot, a superhero - anything!). Write down your character's basic information: name, job title, skills, and one unique trait. This character will be your avatar throughout your journey in Laborville.",
      "Your avatar has just been offered a job! Congratulations. But wait, before you start, you need to understand the employment contract. Research about Employment Contracts online, paying close attention to elements such as terms of employment, salary, benefits, confidentiality, and termination provisions. Now, write a simple job contract for your character.",
      "In Laborville, you've heard about something called At-Will Employment. What is it? Research this concept and create a one-page comic strip where your character learns about At-Will Employment. Be sure to highlight its benefits and drawbacks.",
      "Your character needs a secure place to keep their secret superhero cape (or alien translator device!). This leads them to discover Employee Privacy Rights. Investigate these rights online and list them down. Then, create a scenario where your character's privacy rights might be at risk at their workplace, and how they could solve this issue.",
      "Oh no, your avatar lost their job! Luckily, they've heard about Unemployment Insurance. Research how Unemployment Insurance works and write a short story about how your character navigates the process of applying for it in Laborville.",
      "Rumors are circulating about a big corporate scandal at your character's old job. It's time to learn about Whistleblower Protection. Research this concept online and draft a letter your character might write to a friend explaining the whistleblower protection law, and how it could apply to this scandal.",
      "Create a PowerPoint or Prezi presentation summarizing what you've learned about the five concepts. Use images, animations, and humor to make it as engaging as possible.",
      "Choose one of the five concepts you think Laborville needs to improve. Write a persuasive letter to the \"Mayor of Laborville\" (you can create a character for this too!) arguing for changes in this area.",
      "Create a fun online quiz using tools like Kahoot or Quizlet to test your classmates' knowledge about employment law. The quiz should cover all the five concepts."
    ]
  }
]