[
  {
    "Project objective": "Trusts and Estates Law",
    "Steps": [
      "Create a profile for your new citizen of Taxtropolis. Include their name, profession, a unique pet, and a fun tax-related superpower (like the ability to calculate taxes in their sleep!).",
      "Your character has inherited a grand estate, but they've learned about something called the Estate Tax. What is it? Research about Estate Tax and write a diary entry from your character's perspective about their first day in their new estate and their understanding of Estate Tax.",
      "You've been invited to the annual Gift Tax Gala, where everyone exchanges gifts. But there's a catch: the Gift Tax. What is it? Research about Gift Tax and design an invitation for the Gala that explains what Gift Tax is and why it's important.",
      "It's payday in Taxtropolis! But with payday comes Payroll Tax. What is it? Research about Payroll Tax and write a paycheck for your character that includes all the details, including the Payroll Tax.",
      "Your character has landed a job at the renowned Corporate Tax Corporation. What does Corporate Tax mean in this setting? Research about Corporate Tax and write an office memo explaining it to the new employees.",
      "It's the biggest shopping day of the year in Taxtropolis, and all the stores are bustling. But don't forget about the Sales Tax! Research about Sales Tax and create a shopping receipt for your character, showing how the Sales Tax is applied.",
      "Create a newspaper page or a blog post summarizing the five tax concepts, as if it's a regular feature in the Taxtropolis Times. Make it engaging and informative for all the citizens.",
      "Your character has decided to run for the mayor of Taxtropolis. Write a campaign speech where they discuss these five tax concepts and propose a change that they believe would benefit the city.",
      "Using an online tool like Kahoot or Quizlet, create a trivia quiz about the five tax concepts. This quiz will be used in the annual Taxtropolis Trivia Night, a citywide event!",
      "Write a farewell letter from your character to the citizens of Taxtropolis, reflecting on what they've learned during their time there and how it will influence their future endeavors."
    ]
  }
]