[
  {
    "Project objective": "Corporate Law",
    "Steps": [
      "Create a profile for your startup. What's its name? What's the mission? What do your Robo-Pets do that no other AI-powered pets can?",
      "Next, you need to decide on the Corporate Structure. What is a corporate structure, and what options do you have? Write a business plan outlining the structure of your startup.",
      "Now it's time to attract Shareholders. Who are shareholders? Research about them and create a pitch deck to attract potential investors to your startup.",
      "You need a solid Board of Directors to guide your startup. What is the role of the board of directors? Write job descriptions for your dream board members.",
      "Your startup needs key Officers. What roles do officers play in a corporation? Research about it and create an organizational chart for your startup showing the officers and their roles.",
      "Create a digital or physical handbook that summarizes the five concepts as a guide for your startup team. Make it visually appealing, engaging, and informative.",
      "You've been asked to pitch your startup at the annual \"Future of Tech\" conference. Write a powerful pitch script that introduces your startup, discusses its structure, your board, officers, and why investors should become shareholders.",
      "Using an online tool like Kahoot or Quizlet, create a quiz about the five concepts. This is the final test to prove your understanding of the corporate world!",
      "Write a press release announcing the launch of your startup, reflecting on what you've learned during this project, and your plans for the future of your startup."
    ]
  },
  {
    "Project objective": "Corporate Law",
    "Steps": [
      "Update your CEO profile. What's your leadership style? What's your vision for the future of Robo-Pets?",
      "As CEO, you have fiduciary duties. What are these? Research about it and write a CEO's oath, committing to fulfill these duties.",
      "Your company enjoys limited liability. What does this mean? Research about it and write an explanatory note for new employees about the concept.",
      "You must establish good corporate governance. What is corporate governance? Create a corporate governance policy for Robo-Pets.",
      "A rival AI-pets company proposes a merger. What are mergers and acquisitions? Research about it and draft a plan for a potential merger, considering its pros and cons.",
      "You're considering taking Robo-Pets public. What is securities regulation, and why is it important? Write an investor relations statement outlining how Robo-Pets will comply with securities regulations.",
      "Create a digital or handmade guidebook summarizing the five concepts as a guide for your corporate team. Make it visually appealing, engaging, and informative.",
      "You've been asked to speak at Robo-Pets' first annual shareholders meeting. Write a powerful speech that discusses these five concepts and their importance to Robo-Pets' future.",
      "Using an online tool like Kahoot or Quizlet, create a quiz about the five concepts. This is your final test to prove your command over the corporate world!",
      "Write a futuristic news article about Robo-Pets, reflecting on what you've learned during this project and predicting how these concepts will shape the company's future."
    ]
  },
  {
    "Project objective": "Corporate Law",
    "Steps": [
      "Your first Annual General Meeting (AGM) is around the corner. What is an AGM? Research about it and draft an agenda for Robo-Pets' first AGM.",
      "Your shareholders are expecting dividends. What are dividends? Create a report explaining your dividend policy and how dividends will be distributed.",
      "To grow further, you need to delve deeper into corporate finance. What is it? Create a presentation explaining the basic principles of corporate finance and how they apply to Robo-Pets.",
      "A rumor of insider trading circulates in your company. What is insider trading? Write a memo to your employees about the importance of avoiding insider trading and the penalties for such actions.",
      "You've been invited to present at a major investor conference. Write a presentation script that discusses these five concepts and their significance to the future of Robo-Pets.",
      "It's time to test your knowledge! Using an online tool like Kahoot or Quizlet, create a quiz about the five concepts. Share it with your friends or family and see who scores the highest!",
      "Imagine a future scenario for Robo-Pets involving all five concepts. Write a short story about it, showcasing your understanding of these concepts.",
      "Write a vision statement for Robo-Pets, outlining how the company will continue to grow and innovate while adhering to best practices related to these five concepts."
    ]
  }
]