[
  {
    "Project objective": "You are a rookie medical assistant at the bustling healthcare center \"Health Haven.\" Your task is to assist Dr. Medilove, a brilliant yet absent-minded physician who has a propensity for misplacing her medical terminology notes. A patient named Joe has arrived complaining of strange symptoms. You will have to put your knowledge of anatomy, physiology, medical terminology, vital signs, and infection control to the test to solve this puzzling case.",
    "Steps": [
      "Patient Intake: Begin by practicing a patient intake interview. Write out a script for the questions you would ask Joe to understand his medical history and current symptoms.",
      "Anatomy and Physiology Research: Based on Joe's symptoms, select three bodily systems to research more deeply. You should understand how these systems normally function and what could go wrong in the case of disease or disorder.",
      "Decode the Medical Language: Make a list of medical terms related to the three bodily systems you're focusing on. Decode these terms by breaking them down into their roots, prefixes, and suffixes.",
      "Vital Signs Investigation: Record Joe's 'pretend' vital signs as part of his assessment. Use normal ranges for temperature, pulse, respiration rate, and blood pressure, but be creative and adjust one or two slightly (but still safely) outside of the normal range, given his mysterious malady.",
      "Infection Control: Create a list of infection control procedures you would follow in the healthcare center. Make sure to consider personal protective equipment, hand hygiene, and surface disinfection.",
      "Consult with Dr. Medilove: Write an email to 'Dr. Medilove' (your teacher), summarizing Joe's symptoms, his vital signs, and your findings from the anatomy and physiology research. Ask for her opinion on what could be causing Joe's malady.",
      "Prepare for a Follow-Up: Draft a set of follow-up questions for Joe based on Dr. Medilove's response. These questions should be designed to help you gather more information about his condition.",
      "Diagnosis Time: Based on all the information you have gathered and your knowledge of anatomy and physiology, make a 'pretend' diagnosis of Joe's condition.",
      "Educate the Patient: Create a brochure or write a short essay explaining Joe's condition to him. Use layman's terms instead of complex medical jargon to make it easy for Joe to understand his condition."
    ]
  },
  {
    "Project objective": "\"Health Haven Hustle: A Day in the Life of a Medical Assistant",
    "Steps": [
      "Scenario: You're now a medical assistant at \"Health Haven\", a vibrant, local clinic. On your first day, you're given an overview of what an exciting day in a healthcare center looks like. There's a steady stream of unique patients and a variety of tasks that need to be completed, from phlebotomy to electronic health record maintenance. Let's jump into your day!",
      "Materials Needed: Computer with internet access, notepad, pen, mock EKG printout (you can print this from the internet), play syringe, and a simulated patient (a family member or a friend could play this role)",
      "Phlebotomy Practice: Start your day by practicing a mock blood draw from your simulated patient. Write down each step in detail, emphasizing patient comfort and safety.",
      "Understanding Medication Administration: Research three common medications (for example, ibuprofen, metformin, lisinopril). Write a report detailing what each medication is used for, how it should be administered, and any important side effects or interactions.",
      "Simulating EKG: Print out a sample EKG. Explain what information it shows about the heart and how it helps diagnose health conditions. Create a fictional patient scenario based on the EKG results."
    ]
  },
  {
    "Project objective": "Health Haven Heroes: Office Odyssey",
    "Steps": [
      "Scenario: After a few weeks on the job, you've been temporarily assigned to manage the Health Haven office due to an unforeseen staffing shortage. As you navigate this role, you'll handle professional communication, ethical dilemmas, health promotion, and first aid emergencies. This project involves the production of a video blog (\"vlog\") of your experience.",
      "Materials Needed: Computer with internet access, notepad, pen, smartphone or webcam for recording, optional props (like a First Aid kit)",
      "Setting the Stage: Start by sketching a layout of Health Haven's office. Consider the spaces required for different functions like reception, consultations, waiting area, and more.",
      "Diving into Office Management: Write a list of the key tasks and responsibilities that you'd need to manage as the office manager. This might include scheduling, supplies management, and staff coordination.",
      "Professional Communication: Write and record a short script where you answer a patient's phone call. Remember to keep it professional, courteous, and helpful.",
      "Ethical Dilemma: Write a script for a fictional scenario where you encounter an ethical issue at work (for example, a breach of patient confidentiality). Record a video explaining how you would handle this situation according to medical ethics and laws.",
      "Promoting Health: Create a flyer or a digital poster for a health promotion campaign you want to run in the clinic. This could be about the importance of vaccinations, healthy eating, or regular exercise.",
      "Communicating Health Promotion: Record a short public service announcement video based on your health promotion campaign from Step 5.",
      "Learning about Diseases: Research a common disease, like diabetes or hypertension. Create an informative brochure or a video about the disease, its prevention, and management.",
      "First Aid Knowledge: Make a list of the essential items in a First Aid kit and explain their uses.",
      "CPR Demonstration: Using a pillow or a stuffed animal as a 'patient', demonstrate how you would perform CPR. Remember, this is a mock demonstration, do not practice on a real person.",
      "Reflect and Summarize: Compile your work into a 'Day in the Life' vlog, showcasing your work as a temporary office manager at Health Haven. Reflect on what you learned and which tasks you found most interesting or challenging."
    ]
  }
]