[
  {
    "Project objective": "Pharmacy Technician",
    "Steps": [
      "Start by researching the role of a Pharmacy Technician. Find out what their typical duties are, the skills they need, and the kind of environments they work in.",
      "Look into the qualifications needed to become a Pharmacy Technician. What kind of education or certification do they need? Write a summary of your findings.",
      "Research different types of medications commonly handled by Pharmacy Technicians. Pick ten and summarize their uses, potential side effects, and any important precautions.",
      "Hypothetical Scenario #1: Imagine you're a Pharmacy Technician and a customer has questions about one of the medications you've researched. Write a script for how you would explain its use and answer their questions.",
      "Learn about the safety protocols and ethical guidelines Pharmacy Technicians must follow. Write a list of the top ten rules you believe are most important.",
      "Study the systems used for managing and dispensing medications in a pharmacy. Describe how prescriptions are filled and how medications are organized.",
      "Hypothetical Scenario #2: You're working as a Pharmacy Technician and notice a potential error on a prescription. It could be a dosage issue or a possible harmful drug interaction. Write a report of the situation and the steps you would take to address it.",
      "Learn about how a Pharmacy Technician interacts with other healthcare professionals. Write a few example communications, such as emails or phone call scripts, that a Pharmacy Technician might have with a doctor's office or insurance company.",
      "Reflect on the importance of the Pharmacy Technician role in the healthcare system. Write a short essay discussing their contributions and why they are valuable.",
      "Compile all of your research, scripts, reports, and reflections into a digital presentation. This could be a slide show or a video presentation explaining the role and responsibilities of a Pharmacy Technician."
    ]
  }
]