[
  {
    "Project objective": "An Epic Journey into the Life of an Imaginary Beast!",
    "Steps": [
      "Define your creature's anatomy. How is its skeletal system designed? Where are its organs? Create a detailed anatomical sketch or digital design.",
      "Identify how your creature's body functions. How does it digest food? How does its circulatory system work? Write a brief report explaining your creature's physiological processes.",
      "What does your creature eat? How often? Design a \"nutrition facts\" sheet for your creature's diet.",
      "Create a daily routine for your creature, covering from when it wakes up to when it sleeps. Does it socialize? Is it nocturnal or diurnal?",
      "Choose a parasite that will inhabit your creature. Research this parasite and determine how it affects your creature.",
      "Assess how this parasitic relationship affects your creature's behavior, nutrition, and general health. Write a short report detailing your findings.",
      "Present your imaginary creature and its life story to your class in an online forum. Share your sketches, nutritional facts, behavioral analysis, and parasitology report.",
      "Reflect on your journey of creating this imaginary beast. What did you learn about animal life from this project? Write a short reflection on your experience."
    ]
  },
  {
    "Project objective": "Mission Zoonosis: Uncover, Prevent, Treat",
    "Steps": [
      "Choose a zoonotic disease to focus on. It could be anything from rabies to bird flu. Write a brief description of the disease and its zoonotic nature.",
      "Understand and explain how the disease interacts with the immune system. Create a comic strip or a storyboard showing the immune response to the disease.",
      "Research the common drugs used to treat this disease in humans and animals. Create a \"prescription\" card for your disease detailing the drug, dosage, and any potential side effects.",
      "Research how diagnostic imaging (like X-rays or ultrasound) can help in detecting or managing your chosen disease. Draw or digitally design an example image, pointing out what vets or doctors would look for.",
      "Create a comprehensive plan on how you, as a superhero vet, would prevent the spread of this zoonotic disease.",
      "Draw a picture or create a digital avatar of your superhero character, including a fun, animal-related superhero name.",
      "Compile all your information and findings into a story format. Share how your superhero character fought against the zoonotic disease using their veterinary skills and knowledge.",
      "Exchange your story with a friend or classmate and ask for feedback. Do the same for their story.",
      "Reflect on what you learned through this process and prepare a short presentation to share your superhero story and the knowledge you gained about your chosen zoonotic disease."
    ]
  },
  {
    "Project objective": "Dr. Doolittle's Diary: Journey to Exotic Animal Kingdom",
    "Steps": [
      "Choose an exotic animal that you find interesting. This animal will be the focus of your guidebook.",
      "Learn the basic veterinary terminology related to your chosen animal and create a glossary for your guidebook. Include terms that describe the animal's anatomy, common diseases, and treatments.",
      "Research preventive medicine practices for your chosen animal. Write a section in your guidebook explaining what owners can do to keep the animal healthy.",
      "Look into the common diseases (epidemiology) that affect your chosen animal. Write a brief report on each disease, including symptoms, transmission methods, and prevention strategies.",
      "Delve into the ethical considerations and welfare issues related to keeping and treating your chosen exotic animal. Write an \"Ethics & Welfare\" chapter for your guidebook discussing these issues.",
      "Investigate the common medical procedures and treatments used in exotic animal medicine for your chosen animal. Create a \"Medical Management\" section in your guidebook that explains these procedures and treatments.",
      "Imagine a week in the life of Dr. Doolittle treating your chosen animal. Write diary entries describing the interactions, treatments, and preventive measures taken. Remember to use your new veterinary terminology!",
      "Exchange your guidebook with a friend or classmate for review. Take their feedback into consideration and revise your work. Similarly, provide constructive feedback for their project.",
      "Prepare a presentation to share your guidebook. Explain why you chose your specific animal and share the most interesting facts you discovered during your research.",
      "Reflect on your experience as Dr. Doolittle's intern. Write a final diary entry about what you've learned and how it has shaped your perspective on exotic animal medicine."
    ]
  }
]