[
  {
    "Project objective": "Maritime Marvels: Design Your Dream Aquatic Adventure Vessel!",
    "Steps": [
      "Decide on the engine type best suited for your vessel. Justify your choice, considering factors like speed, maneuverability, maintenance, cost, and environmental impact.",
      "Choose the most efficient propulsion system for your marine vessel, and explain why it's the best choice.",
      "Plan the marine electrical system for your vessel. This should cover lighting, navigation systems, communication devices, etc.",
      "Determine if a diesel engine is suitable for your vessel. If it's not, explain why and explore alternatives.",
      "Design the fuel system for your vessel, addressing carburetion and fuel efficiency. Discuss how you can minimize environmental harm.",
      "Merge your chosen systems and engine types into your design. Consider compatibility and overall functionality. Create a comprehensive plan for your marine vessel.",
      "Craft a 'sales pitch' for your vessel, focusing on its unique features, efficiency, environmental considerations, and why it stands out in the market.",
      "Reflect on your project and potential improvements. Discuss any challenges you faced, your learning outcomes, and how your vessel could contribute to marine biology studies.",
      "Congratulations, you have designed a state-of-the-art marine vessel"
    ]
  },
  {
    "Project objective": "From Mariner Misfortune to Seafaring Savant!",
    "Steps": [
      "Research each of the key concepts. This includes marine cooling systems, exhaust systems, transmission systems, steering controls, propeller mechanics, plumbing systems, safety systems, navigation systems, and troubleshooting/diagnostics.",
      "Pick a type of vessel that’s common on Ineptia (e.g., fishing boat, ferry, etc.). This will be the model you use to discuss improvements.",
      "Explain how you'd improve the vessel's cooling system and why it's important for the engine's performance and longevity.",
      "Describe the ideal marine exhaust system for your chosen vessel, including the benefits of a well-functioning one.",
      "Investigate the current steering system and controls. Propose improvements to increase maneuverability and safety.",
      "Explore the vessel's transmission system. How would you optimize it for smoother operations?",
      "Dive into propeller mechanics. Propose propeller modifications that will improve the vessel's efficiency and speed.",
      "Analyze the vessel's plumbing system, suggest enhancements, and emphasize their importance in a maritime setting.",
      "Evaluate the current safety and navigation systems. How can these be upgraded to ensure safe and effective sea travels?"
    ]
  }
]