[
  {
    "Project objective": "The Mysteries of the Color-Changing Potion.  Create a color-changing potion using chemical reactions, while exploring mass and energy balances, thermodynamics, chemical kinetics, fluid mechanics, and heat and mass transfer.",
    "Steps": [
      "Prepare the following equipment: Beakers or glass jars; Food coloring (red, blue, yellow); Baking soda; Vinegar; Stopwatch; Thermometer; Measuring spoons; Safety goggles; Gloves; Lab apron",
      "Safety first! Before starting the experiment, put on your safety goggles, gloves, and lab apron to protect yourself from spills and splashes. Prepare your workstation: Set up three beakers or glass jars on a flat surface. In each jar, add 100 mL of water.",
      "Create a color palette: Add a few drops of food coloring to each jar to create three different colors. For example, red in jar 1, blue in jar 2, and yellow in jar 3.",
      "Explore mass and energy balances: Measure and record the mass of baking soda and vinegar you will use in the experiment. Observe and record any changes in temperature during the reaction.",
      "Unleash the reaction: Add one teaspoon of baking soda to jar 1. Next, pour in 50 mL of vinegar and observe the reaction. Note the color change, gas production, and any changes in temperature.",
      "Dive into thermodynamics: Using the thermometer, measure the initial and final temperatures of the solution in jar 1. Discuss how the temperature change relates to the energy released or absorbed during the reaction.",
      "Investigate chemical kinetics: Repeat step 5 with jar 2, but this time, use a stopwatch to record the time it takes for the color change to occur. Discuss how factors such as temperature and concentration might affect the reaction rate.",
      "Experience fluid mechanics: Gently swirl jar 3 to observe the flow of the colored water. Discuss how fluid viscosity and density might influence the motion of the liquid.",
      "Discover heat and mass transfer: Place jar 3 in a warm location, such as near a sunny window or a heater, and observe any changes in color intensity or fluid properties over time. Discuss how heat and mass transfer could affect the experiment's outcome.",
      "Share your findings: Summarize your observations and conclusions in a short presentation or report. Share your newfound knowledge of chemical engineering concepts with your classmates or friends!"
    ]
  },
  {
    "Project objective": "The Great Soda Factory Challenge. Design and build a mini soda factory that demonstrates process control, separation processes, reactor design, process safety, and material and energy balances.",
    "Steps": [
      "Prepare the following equipment: Plastic bottles with caps (500 mL); Small plastic tubing; Carbonated water; Fruit juices or flavored syrups; Baking soda; Vinegar",
      "Funnel; Measuring cups and spoons; Safety goggles; Gloves; Lab apron",
      "Safety first! Before starting the experiment, put on your safety goggles, gloves, and lab apron to protect yourself from spills and splashes.",
      "Research and brainstorm: Research different types of soda production processes and brainstorm ideas for your mini soda factory. Consider aspects such as process control, separation processes, reactor design, and process safety.",
      "Plan your factory: Sketch a diagram of your proposed soda factory design, including all components necessary for mixing, carbonating, and bottling your soda. Be sure to consider material and energy balances.",
      "Gather materials: Collect all the equipment needed for your project, as listed above. You may need to improvise or modify some items based on your specific factory design.",
      "Prepare your workspace: Set up your mini soda factory according to your diagram, ensuring all connections are secure, and all components are in their proper place.",
      "Mix your soda base: Combine your chosen fruit juices or flavored syrups with carbonated water in one of the plastic bottles to create the base for your soda. Measure and record the amounts of each ingredient used to keep track"
    ]
  }
]