[
  {
    "Project objective": "Operation P.E.R.F.E.C.T: The Quest for the Ideal Workspace",
    "Steps": [
      "Prepare the following: Computer with Internet access, 3D modeling software (like SketchUp or Tinkercad, many of which have free versions), timer, and a camera for before-and-after photos.",
      "Next, study process engineering. Apply these principles to streamline the workflow at your chosen workspace. Design a more efficient process to complete a common task.",
      "Learn about systems engineering. Consider your workspace and its associated tasks as a system. Identify the components, their interrelationships, and their roles in achieving the task.",
      "Dive into operations research. Use a simple problem-solving technique (like linear programming or network analysis) to optimize an aspect of your workspace's operation.",
      "Explore the concept of quality control. Choose a specific output of your workspace and design a quality control process for it.",
      "Combine your ergonomic design, process engineering, systems engineering, operations research, and quality control plans into a comprehensive workspace improvement plan: The Process-engineered, Ergonomic, Research-optimized, Fine-tuned, Efficient, Controlled, and Top-notch (P.E.R.F.E.C.T) Plan.",
      "Create a virtual model of your redesigned workspace using any 3D modeling software. Walk through the new workflow, observe the system's operation, and verify the quality control process.",
      "Compare the time taken to complete a task in the current workspace versus the newly designed P.E.R.F.E.C.T workspace. Do the improvements lead to better efficiency?",
      "Compile all your work into a final project report. Include your initial workspace evaluation, the P.E.R.F.E.C.T Plan, the virtual validation results, the time test comparison, and the feedback you received."
    ]
  },
  {
    "Project objective": "Operation S.L.I.M.S: Streamlined, Lean, Inventory and Manufacturing System",
    "Steps": [
      "Identify a real or hypothetical manufacturing operation. This could be a local factory, a bakery, or even a made-up widget workshop.",
      "Research facility layout principles. Evaluate your chosen operation's current layout and draft a more efficient design.",
      "Learn about Six Sigma. Identify a process in your operation that could benefit from this methodology, then outline a plan to implement it.",
      "Investigate supply chain management. Trace the operation's supply chain, then propose changes to improve efficiency or reduce costs.",
      "Delve into inventory management. Evaluate your operation's current inventory system and propose a new, more efficient method.",
      "Combine your new layout, Lean Manufacturing, Six Sigma, supply chain, and inventory management plans into a comprehensive operation overhaul: the Streamlined, Lean, Inventory and Manufacturing System (S.L.I.M.S).",
      "Use a 3D modeling software to create a virtual model of your S.L.I.M.S. Walk through the new process, and verify the improvements in the supply chain and inventory management.",
      "Present your S.L.I.M.S to classmates or family members. Gather their feedback on its feasibility, efficiency, and innovative ideas.",
      "Compile your work into a final project report. Include your initial operation evaluation, the S.L.I.M.S design, the virtual validation, and the feedback you received.",
      "Computer with Internet access, 3D modeling software (like SketchUp or Tinkercad, many of which have free versions), and a camera for before-and-after pictures."
    ]
  },
  {
    "Project objective": "Time-Traveling Tacos: A Fast-Food Fable",
    "Steps": [
      "Choose a real or fictional fast food restaurant that will be the focus of your project. For our example, we'll be using a hypothetical taco stand: \"Time-Traveling Tacos.\"",
      "Prepare the following: Computer with Internet access, simulation software (many free online options are available), project management software or templates (like Microsoft Project or Excel), and creativity for envisioning your fast food operation!",
      "Create a detailed map of the current production process at your restaurant. This should include everything from ingredient prep to order delivery.",
      "Perform a time and motion study on the current process. You might need to use your imagination for this one! Identify bottlenecks and inefficiencies.",
      "Use a simulation tool (like Microsoft Project, Gantt charts, or any free online tool) to test the efficiency of your new process compared to the old one.",
      "Based on your simulation, create a production plan that maximizes efficiency and minimizes downtime. This should include scheduling of staff and resources.",
      "Devise a method of measuring the work performed under your new process. This could be anything from taco output to customer wait time.",
      "Now that you've revamped the process, how would you manage this as a project? Create a project management plan that includes scope, time, cost, quality, communication, and risk management plans.",
      "Present your new process and project management plan to your peers or family. Collect their feedback and adjust your plan as necessary.",
      "Compile your work into a final report. Include your initial process map, time and motion study, simulation results, production plan, work measurement method, and project management plan."
    ]
  }
]