[
  {
    "Project objective": "Operation: Invisible World - Uncovering the Secrets of Materials.  Welcome, Agent. Your mission, should you choose to accept it, involves journeying into the invisible world of atoms, crystals, and materials properties. Are you ready? Let's begin!",
    "Steps": [
      "Research and create a model (virtual or physical) representing the atomic structure of three different elements from the periodic table.",
      "Investigate the electrical properties of your chosen material. How does the atomic and crystal structure influence its electrical conductivity?",
      "Research the thermal properties of your chosen material. Can it withstand high temperatures? How well does it conduct heat?",
      "Create a hypothetical \"superhero material\" by altering the atomic structure, crystal structure, or other properties of your chosen material. How would these changes affect the material's mechanical, electrical, and thermal properties?",
      "Imagine a practical application for your \"superhero material\". Would it be a heat-resistant coating for space shuttles? A superconductive wire for lossless electricity transmission? Sketch or model your application.",
      "Prepare a \"sales pitch\" presentation for your material. Highlight its unique properties and potential applications. Make sure to emphasize why it's better than existing materials.",
      "Reflect on the feedback you received on your pitch. How could your material be improved? Are there other potential applications? Revise your pitch and model based on this feedback.",
      "Computer with internet access, access to online crystallography visualization tools, modeling materials (optional), research resources for atomic structure, crystallography, and material properties."
    ]
  },
  {
    "Project objective": "Material Matchmakers: Finding the Perfect Material for the Job",
    "Steps": [
      "Choose an object in your home that relies on magnetic properties (e.g., a refrigerator magnet). Research the material it's made from and its specific magnetic properties.",
      "Find a polymer-based item in your household (like a plastic water bottle). Identify the specific type of polymer used and its properties.",
      "Find a ceramic item in your home (like a porcelain plate). Identify the type of ceramic and its properties.",
      "Find an item in your home made from composite materials (like a skateboard deck). Identify the types of materials in the composite and why they are used together.",
      "Choose one of your items and imagine you have to replace the material it's made from with a different one from your list. For example, a metal spoon made from a polymer. What would be the benefits and drawbacks?"
    ]
  },
  {
    "Project objective": "Nano or Not: A Material World Adventure",
    "Steps": [
      "Find an example of a corroded item in your house (like a rusty nail). Document it with photos or drawings and discuss the type of corrosion happening.",
      "Dive into different methods of material processing. Find out how raw materials are transformed into usable forms, like turning iron ore into steel.",
      "Research common material testing techniques, such as tensile strength tests, hardness tests, and impact tests. Understand why and when these tests are important.",
      "Using an egg as your test subject, design a small container or casing using household items to protect the egg from a high drop. This is your practical material test. Make sure to document your design process, choices of materials used, and the results.",
      "Choose an everyday item (like a sunscreen bottle). Research whether it contains nanomaterials. If it does, discuss how they're used and why. If it doesn't, propose a way nanomaterials could improve the product.",
      "Imagine it's 2050. Predict how the materials we use have changed. Do nanomaterials rule the world? Has a new super material been discovered? How have we improved corrosion resistance? Let your imagination run wild!"
    ]
  }
]