{
    "options": [
        "Double-entry bookkeeping",
        "Accounting equation",
        "Assets",
        "Liabilities",
        "Owner's Equity",
        "Revenue",
        "Expenses",
        "Profit",
        "Financial statements",
        "Balance sheet",
        "Income statement",
        "Cash flow statement",
        "Accrual accounting",
        "Cash basis accounting",
        "Depreciation",
        "Accounts receivable",
        "Accounts payable",
        "Bank reconciliation",
        "Budgeting",
        "Financial literacy"
    ],
    "hints": {
        "Double-entry bookkeeping": "A system of recording transactions where every entry impacts two accounts, ensuring that the accounting equation remains in balance.",
        "Accounting equation": "The fundamental equation of accounting, which states that Assets = Liabilities + Owner's Equity.",
        "Assets": "Resources owned by a business or individual that have economic value.",
        "Liabilities": "Debts or obligations owed by a business or individual to others.",
        "Owner's Equity": "The residual interest in the assets of a business after deducting liabilities.",
        "Revenue": "Income generated by a business from its core operations.",
        "Expenses": "The cost of resources used up or consumed by a business in the process of generating revenue.",
        "Profit": "The financial gain resulting from the difference between revenue and expenses.",
        "Financial statements": "Reports that summarize the financial activities of a business, including the balance sheet, income statement, and cash flow statement.",
        "Balance sheet": "A snapshot of a business's financial position at a specific point in time, showing its assets, liabilities, and owner's equity.",
        "Income statement": "A summary of a business's revenues and expenses over a specific period, showing its net income (profit) or net loss.",
        "Cash flow statement": "A report that summarizes the cash inflows and outflows of a business over a specific period, highlighting its operating, investing, and financing activities.",
        "Accrual accounting": "An accounting method that records transactions when they are incurred, not when cash is exchanged.",
        "Cash basis accounting": "An accounting method that records transactions only when cash is received or paid.",
        "Depreciation": "The allocation of the cost of a tangible asset over its useful life.",
        "Accounts receivable": "Money owed to a business by its customers for goods or services provided on credit.",
        "Accounts payable": "Money owed by a business to its suppliers for goods or services purchased on credit.",
        "Bank reconciliation": "The process of comparing a business's bank statement with its internal financial records to ensure accuracy and identify discrepancies.",
        "Budgeting": "The process of creating a plan for a business's income and expenses over a specific period, typically a year.",
        "Financial literacy": "The ability to understand and use various financial skills, including personal finance management, budgeting, and investing."
    }
}