{
    "options": [
        "Coefficients",
        "Expressions",
        "Inequalities",
        "Like terms",
        "Simplifying expressions",
        "Solving equations",
        "Distributive property",
        "Commutative property",
        "Associative property",
        "Substitution method",
        "Elimination method",
        "System of equations",
        "Absolute value",
        "Factoring",
        "Quadratic equations",
        "Exponents",
        "Radicals",
        "Rational expressions",
        "Linear functions",
        "Slope",
        "Y-intercept",
        "Graphing linear equations"
    ],
    "hints": {
        "Coefficients": "Coefficients are the numerical values that multiply variables in a term or expression. For example, in the expression 3x^2, the coefficient is 3.",
        "Expressions": "Expressions are mathematical statements that consist of variables, constants, and operations such as addition, subtraction, multiplication, and division. They may or may not have an equal sign. For example, 2x + 5y is an expression.",
        "Inequalities": "Inequalities are mathematical statements that compare the relative sizes of two values. They use symbols such as < (less than), > (greater than), ≤ (less than or equal to), ≥ (greater than or equal to), or ≠ (not equal to). For example, x > 3 is an inequality.",
        "Like terms": "Like terms are terms in an algebraic expression that have the same variables raised to the same power. They can be combined or simplified by adding or subtracting their coefficients. For example, 3x and 5x are like terms.",
        "Simplifying expressions": "Simplifying expressions involves combining like terms, performing operations, and applying mathematical properties to make the expression simpler or more concise. It aims to reduce the complexity of the expression without changing its value.",
        "Solving equations": "Solving equations involves finding the values of the variables that make the equation true. The process typically includes isolating the variable on one side of the equation and performing operations to determine its value.",
        "Distributive property": "The distributive property states that when a number is multiplied by a sum or difference inside parentheses, it can be distributed or applied to each term inside the parentheses. For example, in the expression 3(x + 2), the 3 can be distributed to both x and 2: 3x + 6.",
        "Commutative property": "The commutative property states that the order of the terms or factors does not affect the result of addition or multiplication. For example, a + b = b + a and ab = ba.",
        "Associative property": "The associative property states that the grouping of terms or factors does not affect the result of addition or multiplication. For example, (a + b) + c = a + (b + c) and (ab)c = a(bc).",
        "Substitution method": "The substitution method is a technique used to solve a system of equations by substituting the value of one variable from one equation into the other equation. This allows for solving the equations and finding the values of the variables.",
        "Elimination method": "The elimination method is a technique used to solve a system of equations by manipulating the equations to eliminate one variable when they are added or subtracted. This leads to a new equation with only one variable, which can then be solved.",
        "System of equations": "A system of equations is a set of two or more equations with the same variables. It represents a situation where multiple equations need to be solved simultaneously to find the values of the variables that satisfy all the equations.",
        "Absolute value": "The absolute value of a number is its distance from zero on the number line, regardless of its positive or negative sign. It is always a non-negative value. For example, the absolute value of -5 is 5.",
        "Factoring": "Factoring involves breaking down an algebraic expression or number into its factors. It helps simplify expressions or solve equations by identifying common factors.",
        "Quadratic equations": "Quadratic equations are equations of the form ax^2 + bx + c = 0, where a, b, and c are constants, and x is the variable raised to the power of 2. They can be solved using various methods such as factoring, completing the square, or using the quadratic formula.",
        "Exponents": "Exponents represent repeated multiplication of a base number by itself. They indicate how many times the base is multiplied by itself. For example, in 2^3, 2 is the base and 3 is the exponent, resulting in 2 * 2 * 2 = 8.",
        "Radicals": "Radicals or square roots are the opposite of squaring a number. They represent finding the value that, when multiplied by itself, gives the original number. For example, the square root of 16 is 4, because 4 * 4 = 16.",
        "Rational expressions": "Rational expressions are expressions that involve ratios of two polynomials. They are fractions in which the numerator and denominator are both polynomials. For example, (3x^2 + 2x) / (5x - 1) is a rational expression.",
        "Linear functions": "Linear functions are functions that have a constant rate of change and produce a straight line when graphed. They can be represented by the equation y = mx + b, where m is the slope and b is the y-intercept.",
        "Slope": "Slope is a measure of the steepness of a line. It represents the rate of change between two points on a line and is calculated by dividing the change in y-coordinates by the change in x-coordinates.",
        "Y-intercept": "The y-intercept is the point where a line intersects the y-axis. It is the value of y when x is equal to zero. In the equation y = mx + b, the y-intercept is represented by the constant term b.",
        "Graphing linear equations": "Graphing linear equations involves plotting points on a coordinate plane to represent the solutions of an equation and connecting them to form a line. It helps visualize the relationship between variables and the pattern of the equation."
    }
}
