{
    "options": [
        "Brain",
        "Heart",
        "Lungs",
        "Liver",
        "Kidneys",
        "Stomach",
        "Small Intestine",
        "Large Intestine",
        "Skin",
        "Muscles",
        "Bones",
        "Spinal Cord",
        "Blood",
        "Bladder",
        "Pancreas",
        "Spleen",
        "Esophagus",
        "Trachea",
        "Ovaries (in females)",
        "Testes (in males)",
        "Endocrine System",
        "Lymphatic System",
        "Tendons",
        "Ligaments",
        "Cartilage",
        "Periosteum",
        "Fascia",
        "Synovial Joints",
        "Neurons",
        "Hormones",
        "Platelets",
        "Bronchi",
        "Alveoli",
        "Gallbladder",
        "Thyroid"
    ],
    "hints": {
        "Brain": "Processes sensory information and controls body functions.",
        "Heart": "Pumps blood and circulates oxygen and nutrients.",
        "Lungs": "Facilitate respiration by exchanging oxygen and carbon dioxide.",
        "Liver": "Filters blood, breaks down toxins, and metabolizes nutrients.",
        "Kidneys": "Remove waste products and regulate electrolyte balance.",
        "Stomach": "Breaks down food using gastric acid and enzymes.",
        "Small Intestine": "Digests food and absorbs nutrients.",
        "Large Intestine": "Absorbs water and forms feces.",
        "Skin": "Protects the body, regulates temperature, and detects sensations.",
        "Muscles": "Contract and relax to facilitate movement and maintain posture.",
        "Bones": "Provide structural support, protect organs, and store minerals.",
        "Spinal Cord": "Transmits signals between the brain and the rest of the body.",
        "Blood": "Transports oxygen, nutrients, and waste products throughout the body.",
        "Bladder": "Stores and expels urine.",
        "Pancreas": "Produces digestive enzymes and hormones, such as insulin.",
        "Spleen": "Filters blood and helps the immune system fight infections.",
        "Esophagus": "Transports food from the mouth to the stomach.",
        "Trachea": "Transports air to and from the lungs.",
        "Ovaries (in females)": "Produce eggs and female hormones.",
        "Testes (in males)": "Produce sperm and male hormones.",
        "Endocrine System": "A collection of glands that secrete hormones to regulate various body functions, such as growth, metabolism, and reproduction.",
        "Lymphatic System": "A network of vessels and nodes that transport and filter lymph fluid, support the immune system, and help maintain fluid balance in the body.",
        "Tendons": "Connective tissue that attaches muscles to bones, facilitating movement.",
        "Ligaments": "Connective tissue that connects bones to other bones, providing joint stability.",
        "Cartilage": "Flexible, semi-rigid connective tissue that provides support, reduces friction, and absorbs shock in joints.",
        "Periosteum": "A dense membrane that covers the surface of bones, providing nourishment and supporting bone growth.",
        "Fascia": "A layer of fibrous connective tissue that surrounds and separates muscles, organs, and other structures.",
        "Synovial Joints": "Joints that contain a lubricating synovial fluid and allow for a wide range of motion, such as the knee or elbow.",
        "Neurons": "Specialized cells that transmit electrical signals within the nervous system.",
        "Hormones": "Chemical messengers secreted by endocrine glands that regulate various physiological processes in the body.",
        "Platelets": "Small blood cell fragments that play a crucial role in blood clotting and wound healing.",
        "Bronchi": "The main airways that branch from the trachea into the lungs, facilitating the passage of air.",
        "Alveoli": "Tiny air sacs in the lungs where the exchange of oxygen and carbon dioxide takes place.",
        "Gallbladder": "A small organ that stores bile produced by the liver, releasing it into the small intestine to aid digestion.",
        "Thyroid": "An endocrine gland located in the neck that produces hormones regulating metabolism and growth."
    }
}