{
    "options": [
        "Culture",
        "Society",
        "Ethnography",
        "Archaeology",
        "Linguistic anthropology",
        "Cultural relativism",
        "Ethnocentrism",
        "Kinship",
        "Social structure",
        "Gender roles",
        "Subsistence strategies",
        "Religion and belief systems",
        "Mythology and folklore",
        "Globalization",
        "Human evolution",
        "Cultural diffusion",
        "Migration",
        "Social inequality",
        "Material culture",
        "Symbolism"
    ],
    "hints": {
        "Culture": "The shared beliefs, values, customs, and practices that define a group of people.",
        "Society": "A group of people who live together and share a common culture, usually within a defined territory.",
        "Ethnography": "A detailed study of a particular cultural group, often based on extensive fieldwork.",
        "Archaeology": "The study of past human societies through the analysis of artifacts and other material remains.",
        "Linguistic anthropology": "The study of language and its relationship to culture, social organization, and human cognition.",
        "Cultural relativism": "The belief that all cultures are equally valid and should be understood in their own terms, not judged by the standards of another culture.",
        "Ethnocentrism": "The belief that one's own culture is superior to all others and the tendency to judge other cultures by the standards of one's own culture.",
        "Kinship": "The system of social relationships that define family structures and determine how people are related to one another.",
        "Social structure": "The organization of relationships within a society, including social institutions, social groups, and social hierarchies.",
        "Gender roles": "The cultural expectations and behaviors associated with being male or female in a given society.",
        "Subsistence strategies": "The methods and resources used by a society to produce food and other necessities for survival.",
        "Religion and belief systems": "The organized systems of beliefs, practices, and rituals that help people make sense of the world and their place in it.",
        "Mythology and folklore": "The traditional stories, legends, and beliefs that convey cultural values, history, and beliefs of a society.",
        "Globalization": "The increasing interconnectedness of people, cultures, and economies around the world.",
        "Human evolution": "The study of the biological and cultural development of humans and their ancestors over time.",
        "Cultural diffusion": "The spread of cultural ideas, practices, and innovations from one society to another.",
        "Migration": "The movement of people from one geographic area to another, often in search of better opportunities or living conditions.",
        "Social inequality": "The unequal distribution of resources, power, and status within a society.",
        "Material culture": "The physical objects, tools, and artifacts created and used by a society, which reflect its cultural values and practices.",
        "Symbolism": "The use of signs, symbols, and rituals to convey meaning, express cultural beliefs, and communicate complex ideas."
    }
}