{
    "options": [
        "Single digit addition",
        "Single digit subtraction",
        "Double digit addition",
        "Double digit subtraction",
        "Single digit multiplication",
        "Single digit division",
        "Double digit multiplication",
        "Double digit division",
        "Factor identification",
        "Prime number identification",
        "Greatest Common Divisor",
        "Least Common Multiple",
        "Ratios",
        "Proportions",
        "Absolute Value",
        "Rounding",
        "Estimation",
        "Fraction simplification",
        "Convert a fraction to improper (1 1 over 2 to 3 over 2)",
        "Convert to proper fraction",
        "Fraction addition with common denominators",
        "Fraction addition without common denominators",
        "Easy fraction multiplication",
        "Medium-difficulty fraction multiplication",
        "Add and subtract with decimals",
        "Multiplication and division with decimals",
        "Convert decimals to percentages",
        "Convert percentages to decimals",
        "Exponents",
        "Square Roots",
        "Order of Operations"
    ],
    "hints": {
        "Single digit addition": "Single digit addition refers to the process of combining two single-digit numbers to find their sum. For example, adding 3 and 5 would result in 8.",
        "Single digit subtraction": "Single digit subtraction involves subtracting a single-digit number from another single-digit number to find the difference. For instance, subtracting 4 from 9 would yield 5.",
        "Double digit addition": "Double digit addition involves adding two numbers, each consisting of two digits, to find their sum. For example, adding 34 and 57 would result in 91.",
        "Double digit subtraction": "Double digit subtraction requires subtracting a two-digit number from another two-digit number to find the difference. For instance, subtracting 72 from 98 would yield 26.",
        "Single digit multiplication": "Single digit multiplication involves multiplying two single-digit numbers together. For example, multiplying 3 and 4 would result in 12.",
        "Single digit division": "Single digit division refers to dividing a single-digit number by another single-digit number. For instance, dividing 8 by 2 would yield 4.",
        "Double digit multiplication": "Double digit multiplication involves multiplying two numbers, each consisting of two digits. For example, multiplying 23 and 57 would result in 1311.",
        "Double digit division": "Double digit division requires dividing a two-digit number by another two-digit number. For instance, dividing 84 by 12 would yield 7.",
        "Factor identification": "Factor identification involves determining the numbers that divide evenly into a given number. For example, the factors of 12 are 1, 2, 3, 4, 6, and 12.",
        "Prime number identification": "Prime number identification refers to recognizing numbers that are only divisible by 1 and themselves. For instance, 7 is a prime number because it can only be divided evenly by 1 and 7.",
        "Greatest Common Divisor": "The Greatest Common Divisor (GCD) is the largest number that divides evenly into two or more given numbers. For example, the GCD of 18 and 24 is 6.",
        "Least Common Multiple": "The Least Common Multiple (LCM) is the smallest multiple that is divisible by two or more given numbers. For instance, the LCM of 4 and 6 is 12.",
        "Ratios": "Ratios represent the quantitative relationship between two or more quantities. They express the proportion or comparison between the numbers. For example, a ratio of 2:3 represents that the first quantity is two-thirds the size of the second quantity.",
        "Proportions": "Proportions are mathematical expressions that equate two ratios or fractions, stating that two ratios are equivalent. They help solve problems involving the unknown value in a proportional relationship.",
        "Absolute Value": "The absolute value of a number represents its distance from zero on the number line, regardless of its positive or negative sign. For example, the absolute value of -5 is 5.",
        "Rounding": "Rounding is the process of approximating a number to a certain degree of accuracy. It involves replacing a number with a nearby value that has a specified number of significant digits or decimal places.",
        "Estimation": "Estimation is the process of making an approximate or educated guess about a quantity or value. It is used to get a quick and reasonable approximation when the exact value is not required.",
        "Fraction simplification": "Fraction simplification involves reducing a fraction to its simplest form by dividing the numerator and denominator by their greatest common divisor. For example, simplifying 4/8 to 1/2.",
        "Convert a fraction to improper (1 1 over 2 to 3 over 2)": "Converting a mixed number to an improper fraction involves expressing the whole number part as a fraction and combining it with the fractional part. For example, converting 2 1/4 to 9/4.",
        "Convert to proper fraction": "Converting an improper fraction to a proper fraction involves expressing it as a mixed number, separating the whole number part from the fractional part. For example, converting 7/3 to 2 1/3.",
        "Fraction addition with common denominators": "Fraction addition with common denominators involves adding fractions that have the same denominator. The numerators are added while the denominator remains the same. For example, adding 1/4 and 3/4 would yield 4/4, which simplifies to 1.",
        "Fraction addition without common denominators": "Fraction addition without common denominators requires finding a common denominator before adding the fractions. The fractions are adjusted to have the same denominator before adding the numerators. For example, adding 1/3 and 1/4 would yield 7/12.",
        "Easy fraction multiplication": "Easy fraction multiplication involves multiplying two fractions with relatively simple numerators and denominators. For example, multiplying 2/5 and 3/8 would result in 6/40, which simplifies to 3/20.",
        "Medium-difficulty fraction multiplication": "Medium-difficulty fraction multiplication involves multiplying two fractions with larger or more complex numerators and denominators. For example, multiplying 7/9 and 5/11 would yield 35/99.",
        "Add and subtract with decimals": "Adding and subtracting with decimals involves performing the arithmetic operations of addition and subtraction with numbers that include decimal points. The numbers are lined up according to their decimal places and the operation is carried out as usual.",
        "Multiplication and division with decimals": "Multiplying and dividing with decimals involves performing the arithmetic operations of multiplication and division with numbers that include decimal points. The numbers are treated as if they have no decimal points, and the final result is adjusted based on the number of decimal places.",
        "Convert decimals to percentages": "Converting decimals to percentages involves expressing a decimal value as its equivalent percentage. For example, converting 0.75 to a percentage would yield 75%.",
        "Convert percentages to decimals": "Converting percentages to decimals involves expressing a percentage value as its equivalent decimal. For example, converting 50% to a decimal would yield 0.5.",
        "Exponents": "Exponents represent repeated multiplication of a base number by itself. They indicate how many times the base is multiplied by itself. For example, in 2^3, 2 is the base and 3 is the exponent, resulting in 2 * 2 * 2 = 8.",
        "Square Roots": "Square roots are the opposite of squaring a number. They represent finding the value that, when multiplied by itself, gives the original number. For example, the square root of 16 is 4, because 4 * 4 = 16.",
        "Order of Operations": "The Order of Operations is a set of rules that dictates the sequence in which mathematical operations should be performed in an expression. The acronym PEMDAS (Parentheses, Exponents, Multiplication and Division, Addition and Subtraction) is commonly used to remember the order. It ensures that calculations are done consistently and accurately."
    }
}