{
    "options": [
        "References",
        "Solar System",
        "Planets",
        "Moons",
        "Stars",
        "Constellations",
        "Milky Way",
        "Galaxies",
        "Nebulae",
        "Black Holes",
        "Comets",
        "Asteroids",
        "Meteoroids, Meteors, and Meteorites",
        "Aurora",
        "Space Telescopes",
        "Gravity",
        "Light-year",
        "Supernova",
        "Exoplanets",
        "Big Bang Theory",
        "Space Exploration"
    ],
    "hints": {
        "Solar System": "The collection of celestial bodies, including the Sun, planets, moons, and other objects, that orbit the Sun.",
        "Planets": "Large celestial bodies that orbit a star, like Earth, Mars, and Jupiter.",
        "Moons": "Natural satellites that orbit planets.",
        "Stars": "Massive, luminous spheres of plasma that generate energy through nuclear fusion.",
        "Constellations": "Patterns of stars in the sky that have been given names, often related to mythology.",
        "Milky Way": "The spiral galaxy that contains our Solar System.",
        "Galaxies": "Massive systems of stars, gas, dust, and dark matter held together by gravity.",
        "Nebulae": "Giant clouds of gas and dust in space where stars are born.",
        "Black Holes": "Regions of spacetime with such strong gravity that nothing, not even light, can escape.",
        "Comets": "Small celestial objects made of ice, rock, and dust that orbit the Sun and develop a glowing tail when they approach it.",
        "Asteroids": "Small, rocky celestial bodies that orbit the Sun, mostly found in the Asteroid Belt between Mars and Jupiter.",
        "Meteoroids, Meteors, and Meteorites": "Small celestial objects that enter Earth's atmosphere (meteors) and sometimes reach the ground (meteorites).",
        "Aurora": "Natural light displays in the sky, usually near the polar regions, caused by charged particles colliding with Earth's atmosphere.",
        "Space Telescopes": "Instruments like the Hubble Space Telescope that observe celestial objects from space to avoid interference from Earth's atmosphere.",
        "Gravity": "The force that attracts objects with mass, playing a crucial role in the formation and movement of celestial bodies.",
        "Light-year": "The distance light travels in one year, used to measure vast distances in space.",
        "Supernova": "The powerful explosion of a massive star at the end of its life cycle.",
        "Exoplanets": "Planets that orbit stars outside our Solar System.",
        "Big Bang Theory": "The leading explanation for the origin of the universe, stating that it began as a hot, dense point and has been expanding ever since.",
        "Space Exploration": "The discovery and study of celestial objects and outer space using telescopes, satellites, and manned or unmanned spacecraft."
    }
}