{
    "options": [
        "Cell theory",
        "Prokaryotes and Eukaryotes",
        "Plant and animal cells",
        "Cell organelles",
        "Photosynthesis",
        "Cellular respiration",
        "DNA and genes",
        "Chromosomes",
        "Mitosis and meiosis",
        "Genetics",
        "Dominant and recessive traits",
        "Evolution",
        "Natural selection",
        "Food chains and food webs",
        "Ecosystems",
        "Biomes",
        "Biodiversity",
        "Adaptations",
        "Classification and taxonomy",
        "Human body systems"
    ],
    "hints": {
        "Cell theory": "The principle that all living organisms are made up of cells, which are the basic units of life.",
        "Prokaryotes and Eukaryotes": "The distinction between the two types of cells, with prokaryotes being simpler and eukaryotes having a nucleus and other organelles.",
        "Plant and animal cells": "The differences in structure and function between plant and animal cells.",
        "Cell organelles": "The various components within a cell that have specific functions (e.g., nucleus, mitochondria, chloroplasts, endoplasmic reticulum, Golgi apparatus).",
        "Photosynthesis": "The process by which plants convert sunlight, carbon dioxide, and water into glucose and oxygen.",
        "Cellular respiration": "The process by which cells break down glucose to produce energy in the form of ATP.",
        "DNA and genes": "The concept that DNA carries genetic information and is made up of individual units called genes.",
        "Chromosomes": "Structures within cells that contain DNA and are responsible for passing genetic information from one generation to the next.",
        "Mitosis and meiosis": "The differences between these two types of cell division, with mitosis responsible for growth and repair, and meiosis responsible for producing sex cells for reproduction.",
        "Genetics": "The study of heredity and the variation of inherited characteristics.",
        "Dominant and recessive traits": "The understanding that some traits are dominant and mask the expression of other recessive traits in an organism's phenotype.",
        "Evolution": "The process by which species change over time through genetic variation and natural selection.",
        "Natural selection": "The mechanism by which organisms with traits that are better suited to their environment are more likely to survive and reproduce.",
        "Food chains and food webs": "The linear sequence (food chain) and interconnected network (food web) of how energy and nutrients are transferred between organisms in an ecosystem.",
        "Ecosystems": "A community of interacting organisms and their physical environment.",
        "Biomes": "Large-scale ecosystems defined by the specific climate, vegetation, and wildlife found in the region.",
        "Biodiversity": "The variety of life in a particular ecosystem or on Earth as a whole, encompassing genetic, species, and ecosystem diversity.",
        "Adaptations": "Characteristics or traits that help an organism survive and reproduce in its environment.",
        "Classification and taxonomy": "The system of organizing and categorizing living organisms based on shared characteristics.",
        "Human body systems": "The various interconnected systems within the human body that work together to maintain life and health, including the circulatory, respiratory, digestive, nervous, and skeletal systems."
    }
}