{
    "options": [
        "Entrepreneurship",
        "Supply and demand",
        "Profit",
        "Revenue",
        "Costs",
        "Market",
        "Marketing",
        "Competition",
        "Monopoly",
        "Pricing strategy",
        "Business plan",
        "Inventory",
        "Accounting",
        "Budget",
        "Cash flow",
        "Break-even point",
        "Customer service",
        "Human resources",
        "Networking",
        "Globalization"
    ],
    "hints": {
        "Entrepreneurship": "The process of starting and managing a business, usually involving risks and rewards.",
        "Supply and demand": "The basic economic concept that describes the relationship between the quantity of a product or service available and the quantity that people want to buy.",
        "Profit": "The money that remains after a business has paid all its expenses.",
        "Revenue": "The money a business receives from selling goods or services.",
        "Costs": "The expenses a business incurs to produce goods or services, including materials, labor, and overhead.",
        "Market": "A place or environment where buyers and sellers come together to exchange goods and services.",
        "Marketing": "The process of promoting and selling products or services, including advertising, public relations, and market research.",
        "Competition": "The rivalry between businesses for customers, market share, or resources.",
        "Monopoly": "A situation in which one company controls the entire market for a product or service.",
        "Pricing strategy": "The method used by a business to determine how much to charge for its goods or services.",
        "Business plan": "A written document that outlines a company's goals and strategies for achieving them.",
        "Inventory": "The goods or materials that a business has available for sale or use.",
        "Accounting": "The process of recording, analyzing, and reporting financial transactions and information for a business.",
        "Budget": "A financial plan that estimates income and expenses for a specific period of time.",
        "Cash flow": "The movement of money in and out of a business, including income from sales and expenses.",
        "Break-even point": "The point at which a business's revenues equal its costs, and the business begins to make a profit.",
        "Customer service": "The support and assistance provided by a business to its customers, aimed at ensuring satisfaction with products or services.",
        "Human resources": "The department within a business responsible for managing employees, including hiring, training, and payroll.",
        "Networking": "The process of building and maintaining relationships with others, often for professional or business purposes.",
        "Globalization": "The increasing integration and interdependence of economies, societies, and cultures around the world."
    }
}