{
    "options": [
        "Functions and their graphs",
        "Limits",
        "Continuity",
        "Derivatives",
        "Differentiation rules",
        "Implicit differentiation",
        "Higher-order derivatives",
        "Applications of derivatives",
        "Integrals",
        "Indefinite integrals and antiderivatives",
        "Definite integrals",
        "Fundamental theorem of calculus",
        "Integration techniques",
        "Improper integrals",
        "Applications of integrals",
        "Differential equations",
        "Sequences and series",
        "Power series",
        "Taylor and Maclaurin series",
        "Parametric and polar equations"
    ],
    "hints": {
        "Functions and their graphs": "Understanding the basic properties and behavior of functions, as well as their graphical representations.",
        "Limits": "The concept of approaching a particular value without necessarily reaching it, which forms the foundation of calculus.",
        "Continuity": "Understanding when a function is continuous and when it has a discontinuity.",
        "Derivatives": "Calculating the rate of change of a function with respect to its independent variable.",
        "Differentiation rules": "Learning the basic rules for finding derivatives, such as the power rule, product rule, quotient rule, and chain rule.",
        "Implicit differentiation": "Finding the derivative of an implicitly defined function.",
        "Higher-order derivatives": "Calculating the second, third, and higher-order derivatives of a function.",
        "Applications of derivatives": "Using derivatives for various applications, such as optimization problems, related rates, and curve sketching.",
        "Integrals": "Calculating the area under a curve or the accumulated change of a function.",
        "Indefinite integrals and antiderivatives": "Finding the antiderivative of a function and understanding the relationship between differentiation and integration.",
        "Definite integrals": "Evaluating the definite integral to find the exact accumulated change or area under a curve.",
        "Fundamental theorem of calculus": "Understanding the connection between differentiation and integration, as well as the two parts of the theorem.",
        "Integration techniques": "Learning various methods for finding integrals, such as substitution, integration by parts, partial fractions, and trigonometric substitution.",
        "Improper integrals": "Evaluating integrals with infinite limits or discontinuous integrands.",
        "Applications of integrals": "Using integrals for various applications, such as finding areas, volumes, work, and average value of a function.",
        "Differential equations": "Studying equations that involve derivatives and learning methods to solve them, such as separation of variables and integrating factors.",
        "Sequences and series": "Understanding the properties of sequences and series, including convergence and divergence.",
        "Power series": "Representing functions as infinite series of power functions and calculating their radius of convergence.",
        "Taylor and Maclaurin series": "Approximating functions using Taylor and Maclaurin series expansions.",
        "Parametric and polar equations": "Studying functions defined by parametric and polar equations, as well as finding their derivatives and integrals."
    }
}