{
    "options": [
        "Matter",
        "Atoms",
        "Elements",
        "Compounds",
        "Molecules",
        "Chemical reactions",
        "Periodic table",
        "Chemical bonds",
        "States of matter (solid, liquid, gas)",
        "Physical and chemical properties",
        "Mixtures and solutions",
        "Acids and bases",
        "pH scale",
        "Conservation of mass",
        "Chemical formulas",
        "Chemical equations",
        "Atomic structure",
        "Protons, neutrons, and electrons",
        "Chemical energy",
        "Law of conservation of energy"
    ],
    "hints": {
        "Matter": "Anything that has mass and occupies space.",
        "Atoms": "The smallest units of an element that maintain the properties of that element.",
        "Elements": "Pure substances consisting of only one type of atom.",
        "Compounds": "Substances formed by the combination of two or more elements in a fixed ratio.",
        "Molecules": "Groups of two or more atoms bonded together.",
        "Chemical reactions": "Processes that change one set of chemicals into another set of chemicals.",
        "Periodic table": "A chart of elements arranged by atomic number and grouped by similar properties.",
        "Chemical bonds": "Forces that hold atoms together in molecules or compounds.",
        "States of matter (solid, liquid, gas)": "The physical forms in which matter exists.",
        "Physical and chemical properties": "Characteristics of substances that can be observed or measured without changing their chemical identity.",
        "Mixtures and solutions": "Mixtures are combinations of two or more substances that are not chemically bonded, while solutions are homogeneous mixtures of solutes and solvents.",
        "Acids and bases": "Acids are substances that release hydrogen ions (H+) when dissolved in water, while bases release hydroxide ions (OH-).",
        "pH scale": "A measure of acidity or alkalinity of a solution, ranging from 0 (most acidic) to 14 (most basic).",
        "Conservation of mass": "The principle that the total mass of substances in a closed system remains constant during a chemical reaction.",
        "Chemical formulas": "Notations that represent the composition of a compound using element symbols and numbers to show the ratio of atoms.",
        "Chemical equations": "Representations of chemical reactions using symbols and formulas to show the reactants and products.",
        "Atomic structure": "The arrangement of subatomic particles (protons, neutrons, and electrons) within an atom.",
        "Protons, neutrons, and electrons": "Subatomic particles that make up atoms; protons carry a positive charge, neutrons have no charge, and electrons carry a negative charge.",
        "Chemical energy": "The potential energy stored in chemical bonds.",
        "Law of conservation of energy": "The principle that energy cannot be created or destroyed, only converted from one form to another."
    }
}