{
    "options": [
        "Law of supply and demand",
        "Opportunity cost",
        "Marginal analysis",
        "Elasticity of demand",
        "Market equilibrium",
        "Law of diminishing marginal utility",
        "Perfect competition",
        "Monopoly",
        "Oligopoly",
        "Market failure",
        "Gross Domestic Product",
        "Inflation",
        "Unemployment",
        "Fiscal policy",
        "Monetary policy",
        "Aggregate demand",
        "Aggregate supply",
        "Economic growth",
        "International trade",
        "Balance of payments"
    ],
    "hints": {
        "Law of supply and demand": "The price of a product or service is determined by the availability of supply and the demand for it.",
        "Opportunity cost": "The cost of choosing one option over another is the value of the next best alternative that must be foregone.",
        "Marginal analysis": "Decision making based on the comparison of the additional benefits and costs of an action or decision.",
        "Elasticity of demand": "The responsiveness of the quantity demanded to changes in price or income.",
        "Market equilibrium": "The point at which the quantity demanded and supplied of a product or service are equal, resulting in no shortage or surplus.",
        "Law of diminishing marginal utility": "The more a person consumes a good or service, the less additional satisfaction they receive from each additional unit consumed.",
        "Perfect competition": "A market structure in which there are many buyers and sellers, with no one having significant market power, and all firms producing identical goods or services.",
        "Monopoly": "A market structure in which a single firm dominates the market, often resulting in higher prices and lower output.",
        "Oligopoly": "A market structure in which a few firms dominate the market, often leading to collusion and non-competitive behavior.",
        "Market failure": "The inability of the market to allocate resources efficiently, often resulting in externalities or public goods that are not produced in the optimal quantity.",
        "Comparative advantage": "The ability of an individual, firm, or country to produce a particular good or service at a lower opportunity cost than its competitors, which results in more efficient resource allocation and trade.",
        "Consumer surplus": "The difference between the total amount that consumers are willing to pay for a good or service and the total amount that they actually pay. It represents the benefit that consumers receive from being able to purchase a product at a price lower than the maximum they would be willing to pay.",
        "Producer surplus": "The difference between the total amount that producers receive for a good or service and the total amount that it costs them to produce it. It represents the benefit that producers receive from being able to sell a product at a price higher than the minimum they would be willing to accept.",
        "Positive externalities": "The positive effects or benefits that a good or service has on third parties who are not directly involved in the production or consumption of the good or service. Examples include vaccinations and education.",
        "Negative externalities": "The negative effects or costs that a good or service has on third parties who are not directly involved in the production or consumption of the good or service. Examples include pollution and traffic congestion.",
        "Public goods": "Goods that are non-rivalrous (one person's consumption does not reduce availability for others) and non-excludable (no one can be effectively excluded from using the good). Examples include clean air, national defense, and public parks.",
        "Game theory": "A branch of economics that studies the strategic interactions between rational decision-makers, in situations where the outcome of one person's decision depends on the decisions made by others.",
        "Price discrimination": "The practice of charging different prices to different consumers for the same good or service, based on their willingness to pay, rather than differences in the cost of production.",
        "Labor market": "The market where workers offer their services to employers in exchange for wages or salaries. The labor market determines the equilibrium wage rate and the quantity of labor employed in the economy.",
        "Exchange rates": "The rate at which one currency can be exchanged for another, determined by supply and demand factors in the foreign exchange market.",
        "Price floor": "A government-imposed minimum price that can be legally charged for a good or service, typically set above the equilibrium price, with the intention of helping producers, such as minimum wage laws.",
        "Price ceilings": "A government-imposed maximum price that can be legally charged for a good or service, typically set below the equilibrium price, with the intention of helping consumers, such as rent controls."
    }
}