{
    "options": [
        "Accept others' emotions without judging.",
        "Listen closely and ask questions.",
        "Balance helping others and self-care.",
        "Build trust and strengthen relationships.",
        "Learn about and manage your emotions.",
        "Resolve conflicts with empathy and teamwork.",
        "Treat others how you'd like to be treated.",
        "Give compliments and spread kindness.",
        "Show empathy and imagine others' feelings.",
        "Apologize when you've hurt someone.",
        "Avoid gossip, rumors, and put-downs, they hurt.",
        "Forgive others.",
        "Include everyone.  No one likes feeling left out.",
        "Be kind to yourself.",
        "Celebrate others' achievements. Be happy for them.",
        "Be honest and tell the truth even if it's difficult.",
        "Treat others fairly and without discrimination.",
        "Respect other people's property and belongings.",
        "Keep your promises and commitments.",
        "Take responsibility for your actions and mistakes.",
        "Be a good listener and show empathy to others.",
        "Don't cheat or plagiarize, do your own work and give credit to others.",
        "Follow rules and laws to keep society safe and fair.",
        "Don't harm others physically, emotionally, or mentally.",
        "Don't gossip or spread rumors that could hurt others.",
        "Don't steal or take things that don't belong to you.",
        "Don't engage in bullying, teasing, or harassing behavior.",
        "Don't discriminate against others based on their gender, race, religion, or other factors.",
        "Take care of the environment and protect our natural resources."
    ],
    "hints": {
        "Accept others' emotions without judging": "It's important to provide a safe space for others to express their feelings freely, without fear of criticism or judgment.",
        "Listen closely and ask questions": "Show genuine interest and seek to understand others' perspectives by actively engaging in conversations and seeking further clarification.",
        "Balance helping others and self-care": "While it's crucial to assist others, one must also ensure that personal health and well-being aren't neglected.",
        "Build trust and strengthen relationships": "Consistent honesty and reliability can foster a strong bond, which can enhance the quality of our personal and professional relationships.",
        "Learn about and manage your emotions": "Being aware of your emotions and knowing how to manage them in various situations helps improve emotional health and interpersonal interactions.",
        "Resolve conflicts with empathy and teamwork": "Rather than escalating disagreements, approach them with understanding and collaboration, promoting harmony and productivity.",
        "Treat others how you'd like to be treated": "The golden rule serves as a simple guide for respectful and considerate behavior towards others.",
        "Give compliments and spread kindness": "Small gestures of positivity can greatly improve someone's day and promote a supportive environment.",
        "Show empathy and imagine others' feelings": "By trying to understand others' emotions and perspectives, we can form deeper connections and respond more appropriately in interactions.",
        "Apologize when you've hurt someone": "Acknowledging mistakes and offering sincere apologies can mend strained relationships and show personal growth.",
        "Avoid gossip, rumors, and put-downs, they hurt": "Negative words can harm others and deteriorate trust. Opt for constructive discussions instead.",
        "Forgive others": "Holding onto resentment can burden us. Forgiveness, on the other hand, allows for personal peace and healthier relationships.",
        "Include everyone. No one likes feeling left out": "Actively including all individuals promotes a sense of belonging and reduces feelings of loneliness or isolation.",
        "Be kind to yourself": "Show yourself compassion and forgiveness. Your relationship with yourself sets the tone for your relationships with others.",
        "Celebrate others' achievements. Be happy for them": "Genuine support towards others' successes fosters a positive environment and strengthens bonds.",
        "Be honest and tell the truth even if it's difficult": "Honesty builds trust and integrity, even when it's hard to speak the truth.",
        "Treat others fairly and without discrimination": "All individuals deserve respect and equal treatment, regardless of their background, identity, or beliefs.",
        "Respect other people's property and belongings": "Treat others' possessions with care, as this shows respect for their personal space and belongings.",
        "Keep your promises and commitments": "Doing so establishes reliability and trustworthiness, which are key in maintaining strong relationships.",
        "Take responsibility for your actions and mistakes": "Owning up to your errors shows maturity and integrity, and it can lead to growth and improvement.",
        "Be a good listener and show empathy to others": "This involves paying attention, showing understanding, and expressing empathy during conversations.",
        "Don't cheat or plagiarize, do your own work and give credit to others": "This respects intellectual property and ensures academic and professional integrity.",
        "Follow rules and laws to keep society safe and fair": "Adherence to regulations ensures a well-functioning, equitable society.",
        "Don't harm others physically, emotionally, or mentally": "Respect for others' well-being is fundamental to ethical behavior.",
        "Don't gossip or spread rumors that could hurt others": "It's better to share verified information and engage in positive or constructive conversations.",
        "Don't steal or take things that don't belong to you": "Respecting others' property demonstrates honesty and integrity.",
        "Don't engage in bullying, teasing, or harassing behavior": "Treating others with kindness and respect promotes a positive, supportive environment.",
        "Don't discriminate against others based on their gender, race, religion, or other factors": "Everyone deserves respect and equal opportunities, regardless of their personal characteristics.",
        "Take care of the environment and protect our natural resources": "Environmental stewardship is a responsibility we all share, to ensure a sustainable future for ourselves and generations to come.",
        "Don't lie or deceive others": "Honesty is the cornerstone of trust and a crucial component of healthy relationships.",
        "Stand up against injustice": "Use your voice to support those who may not be able to speak up for themselves, and help create a fairer and more equitable society.",
        "Respect people's privacy": "Everyone has the right to their personal space and private life. Avoid prying into someone's private affairs unless you've been invited to do so.",
        "Keep your environment clean": "Maintaining cleanliness is a basic aspect of respect for both your personal environment and shared spaces.",
        "Seek consent": "Whether it's borrowing a friend's notebook or sharing someone's personal information, it's important to seek consent first.",
        "Practice gratitude": "Take time to recognize and appreciate the people and circumstances that have a positive impact on your life.",
        "Offer help when you can": "Lend a helping hand to those in need, whether it's offering your expertise, time, or resources.",
        "Accept and learn from criticism": "Instead of viewing criticism negatively, use it as an opportunity to grow and improve.",
        "Be patient": "Understand that everyone has their own pace and timing. Exercise patience in your interactions and responses.",
        "Value diversity": "Understand and appreciate the unique experiences, perspectives, and backgrounds of others.",
        "Encourage others": "A few words of encouragement can make a huge difference in someone's life. Make it a habit to lift others up.",
        "Think before you speak": "Consider the potential impact of your words before you let them out. Words can be powerful, so use them wisely.",
        "Show appreciation": "Whether it's a kind word or a thank you note, showing appreciation can make someone's day and strengthen your relationship with them.",
        "Stay committed": "Whether you're committed to a person, a job, or a cause, sticking to your commitments shows reliability and integrity.",
        "Apologize sincerely": "When you've wronged someone, offering a sincere apology shows that you acknowledge your mistake and are willing to make amends.",
        "Be open-minded": "Embrace different perspectives and be willing to change your mind in light of new information or understanding.",
        "Show respect to all": "No matter who they are or what their status is, everyone deserves respect.",
        "Practice good digital citizenship": "Be respectful and kind online, protect your privacy and the privacy of others, and use the internet responsibly.",
        "Be accountable": "Owning up to your actions, especially mistakes, shows maturity and integrity.",
        "Always strive for improvement": "Embrace lifelong learning. Take every opportunity to learn, grow, and become a better person."
    }
}