{
    "options": [
        "Latitude and Longitude",
        "Physical Geography",
        "Human Geography",
        "Cartography",
        "Climate Zones",
        "Ecosystems/Biomes",
        "Continental Drift",
        "Globalization",
        "Urbanization",
        "Population Density",
        "Cultural Diffusion",
        "Geopolitics",
        "Natural Resources",
        "Sustainability",
        "Geographic Information System (GIS)",
        "Latitude and Longitude - The system of imaginary lines used to identify any location on Earth with geographical coordinates.",
        "Physical Geography - The study of natural features and processes on the Earth's surface, such as landforms, climate, and ecosystems.",
        "Human Geography - The branch of geography that studies patterns and processes related to humans, including population, culture, urban development, and economic activity.",
        "Cartography - The science of map-making. It encompasses both the aesthetics and science involved in creating a map.",
        "Climate Zones - The division of the Earth's climates into specific climatic zones that are identified by specific criteria.",
        "Ecosystems/Biomes - The various large-scale communities of flora and fauna that exist within geographic zones.",
        "Continental Drift - The movement of the Earth's continents across the planet over geological time.",
        "Globalization - The process by which businesses or other organizations develop international influence or start operating on an international scale.",
        "Urbanization - The process of making an area more urban, usually involving the migration of people from rural areas to cities.",
        "Population Density - Measurement of population per unit area or unit volume.",
        "Cultural Diffusion - The spread of cultural beliefs and social activities from one group to another.",
        "Geopolitics - The study of the effects of geography on politics and international relations.",
        "Natural Resources - Resources that exist in a region naturally, such as minerals, forests, and water bodies.",
        "Sustainability - The practice of using natural resources responsibly so they can support both present and future generations.",
        "Geographic Information System (GIS) - A system used to capture, store, analyze, manage, and present spatial or geographic data."
    ],
    "hints": {}
}