{
    "options": [
        "Earth's layers",
        "Plate tectonics",
        "Continental drift",
        "Rock cycle",
        "Igneous rocks",
        "Sedimentary rocks",
        "Metamorphic rocks",
        "Minerals",
        "Weathering",
        "Erosion",
        "Soil formation",
        "Fossils",
        "Geologic time scale",
        "Relative dating",
        "Absolute dating",
        "Earthquakes",
        "Volcanoes",
        "Glaciers",
        "Mountains",
        "Natural resources"
    ],
    "hints": {
        "Earth's layers": "The Earth is composed of different layers, including the crust, mantle, outer core, and inner core.",
        "Plate tectonics": "The Earth's lithosphere is divided into large plates that move and interact with each other, causing various geological phenomena.",
        "Continental drift": "The theory that continents have moved and changed position over time due to plate tectonics.",
        "Rock cycle": "The process by which rocks are formed, altered, and transformed from one type to another over time.",
        "Igneous rocks": "Rocks formed from the cooling and solidification of magma or lava, such as granite or basalt.",
        "Sedimentary rocks": "Rocks formed from the accumulation and compaction of sediments, like sand, silt, or clay, such as sandstone or shale.",
        "Metamorphic rocks": "Rocks that have been altered by heat, pressure, or chemical processes, such as marble or schist.",
        "Minerals": "Naturally occurring, inorganic, solid substances with a specific chemical composition and crystal structure.",
        "Weathering": "The process of breaking down rocks and minerals into smaller particles through physical, chemical, or biological processes.",
        "Erosion": "The transport of rock, soil, or other materials by water, wind, ice, or gravity.",
        "Soil formation": "The process by which rocks and organic matter are broken down into soil over time.",
        "Fossils": "The remains or traces of ancient plants and animals preserved in rock layers.",
        "Geologic time scale": "A timeline of Earth's history divided into eons, eras, periods, and epochs, based on major geological and biological events.",
        "Relative dating": "A method of determining the age of a rock, fossil, or geologic event by comparing its position in a sequence of rock layers.",
        "Absolute dating": "Techniques used to determine the precise age of rocks or fossils, such as radiometric dating.",
        "Earthquakes": "Vibrations in the Earth's crust caused by the sudden release of energy, usually due to the movement of tectonic plates.",
        "Volcanoes": "Openings in the Earth's crust that release molten rock, ash, and gases from beneath the surface.",
        "Glaciers": "Large masses of ice that slowly move over land, shaping the landscape through erosion and deposition.",
        "Mountains": "Large landforms formed by tectonic forces, such as the collision of plates or volcanic activity.",
        "Natural resources": "Materials found in the Earth's crust, such as metals, minerals, and fossil fuels, that are useful to humans."
    }
}