{
    "options": [
        "Democracy",
        "Constitution",
        "Branches of Government",
        "Executive Branch",
        "Legislative Branch",
        "Judicial Branch",
        "Checks and Balances",
        "Elections",
        "Political Parties",
        "Local Government",
        "Federal/Central Government",
        "Taxes",
        "Public Services",
        "Human Rights",
        "Civic Responsibility"
    ],
    "hints": {
        "Democracy": "A system of government where citizens have the power to elect their leaders and make decisions through voting.",
        "Constitution": "A set of fundamental principles and laws that outline the structure and function of a government.",
        "Branches of Government": "The division of government into separate branches (typically executive, legislative, and judicial) to balance power and prevent abuse.",
        "Executive Branch": "The part of government responsible for enforcing laws and managing the day-to-day affairs of the country, usually led by a president or prime minister.",
        "Legislative Branch": "The law-making branch of government, typically composed of elected representatives in a parliament, congress, or other legislative body.",
        "Judicial Branch": "The branch of government responsible for interpreting laws and administering justice through courts.",
        "Checks and Balances": "A system where each branch of government has the power to monitor and limit the actions of the other branches, ensuring that no single branch becomes too powerful.",
        "Elections": "The process by which citizens choose their leaders and make decisions on specific issues through voting.",
        "Political Parties": "Organized groups of people who share similar beliefs and goals about how a government should be run, and who work together to elect candidates and influence policy.",
        "Local Government": "The level of government responsible for managing the affairs of a specific community, such as a city or town.",
        "Federal/ Central Government": "The national level of government, responsible for managing the affairs of an entire country.",
        "Taxes": "Compulsory payments made by citizens and businesses to fund government services and public programs, such as education, healthcare, and infrastructure.",
        "Public Services": "Services provided by the government for the benefit of its citizens, such as education, healthcare, and emergency services.",
        "Human Rights": "The basic rights and freedoms that every person is entitled to, regardless of nationality, race, religion, or other factors. These rights are typically protected by a country's constitution and laws.",
        "Civic Responsibility": "The duty of citizens to participate in the democratic process, obey laws, and contribute to the welfare of their community and country. This includes voting, paying taxes, and volunteering for community service.",
        "Republic": "A type of government where people elect representatives to make decisions for them.",
        "Monarchy": "A government ruled by a king or queen, who usually inherits their position.",
        "Parliament": "A group of elected representatives who make laws and decisions in some countries.",
        "Dictatorship": "A government where one person has complete power and control over the country.",
        "Separation of Powers": "The division of a government's responsibilities into different branches to prevent any one branch from becoming too powerful.",
        "Bill of Rights": "A list of important rights and freedoms that a government promises to protect for its citizens.",
        "Amendment": "A change or addition to a constitution or set of laws.",
        "Veto": "When a leader, like a president, rejects a law passed by the legislative branch.",
        "Impeachment": "The process of accusing and possibly removing a government official from office for misconduct.",
        "Bicameral Legislature": "A law-making group that has two separate parts, such as the Senate and House of Representatives in the United States.",
        "Filibuster": "A long speech or action that delays a vote on a law in a legislative body.",
        "Referendum": "A vote where citizens decide on a specific issue or question directly.",
        "Federalism": "A system of government where power is divided between a central government and smaller units, like states or provinces.",
        "Sovereignty": "The authority of a country to govern itself and make its own decisions.",
        "Diplomacy": "The practice of building relationships and negotiating with other countries to solve problems and make agreements."
    }
}