{
    "options": [
        "Rights",
        "Constitution",
        "Separation of powers",
        "Rule of law",
        "Democracy",
        "Legislation",
        "Judicial review",
        "Civil law",
        "Criminal law",
        "Contract law",
        "Tort law",
        "Property law",
        "Family law",
        "Due process",
        "Presumption of innocence",
        "Burden of proof",
        "Statute of limitations",
        "Legal representation",
        "Legal liability",
        "Intellectual property"
    ],
    "hints": {
        "Rights": "Basic freedoms and protections that every individual is entitled to.",
        "Constitution": "The fundamental principles and rules that govern a country or organization.",
        "Separation of powers": "The division of government responsibilities into distinct branches (legislative, executive, and judicial) to prevent the concentration of power.",
        "Rule of law": "The principle that everyone, including government officials, must follow and be accountable to the law.",
        "Democracy": "A system of government in which power is vested in the people, who rule either directly or through elected representatives.",
        "Legislation": "Laws created by the legislative branch of government.",
        "Judicial review": "The process by which courts interpret and apply the law, and determine the constitutionality of laws and government actions.",
        "Civil law": "A branch of law dealing with disputes between individuals and organizations, often involving compensation for harm or loss.",
        "Criminal law": "A branch of law that deals with offenses against society, such as theft, assault, and murder.",
        "Contract law": "The body of law governing the formation and enforcement of agreements between parties.",
        "Tort law": "The area of law dealing with wrongful acts that cause harm or injury to others, resulting in civil legal liability.",
        "Property law": "The area of law governing the ownership and use of property, both real (land and buildings) and personal (movable items).",
        "Family law": "The area of law that deals with family-related matters, such as marriage, divorce, and child custody.",
        "Due process": "The principle that guarantees fair treatment and protection of individual rights in legal proceedings.",
        "Presumption of innocence": "The legal principle that a person accused of a crime is considered innocent until proven guilty.",
        "Burden of proof": "The responsibility to prove the truth of a claim or accusation, typically resting on the party making the claim.",
        "Statute of limitations": "A law setting a time limit within which a legal action must be brought.",
        "Legal representation": "The right to have an attorney represent you in legal proceedings.",
        "Legal liability": "The responsibility to compensate others for harm or loss caused by one's actions or inactions.",
        "Intellectual property": "A category of property that includes intangible creations of the human intellect, such as patents, copyrights, and trademarks."
    }
}