{
    "options": [
        "Improvisation",
        "Contact Improvisation",
        "Fall and Recovery",
        "Use of Everyday Movements",
        "Groundwork",
        "Emotion and Individualism",
        "Freedom of Costume Choice",
        "Choreography",
        "Performance Art",
        "Spontaneity",
        "Collaboration",
        "Interdisciplinary Nature",
        "Site-Specific Dance",
        "Body Awareness",
        "Dance Composition"
    ],
    "hints": {
        "Improvisation": "The practice of spontaneous movement, often a key element in modern dance.",
        "Contact Improvisation": "A dance technique involving partners moving in response to each other's movements.",
        "Fall and Recovery": "A dance concept coined by modern dance pioneer Doris Humphrey, involving the rhythm of falling and recovering balance.",
        "Use of Everyday Movements": "In modern dance, ordinary, non-dance movements become part of the choreography.",
        "Groundwork": "Many modern dance techniques involve movements close to the ground, as opposed to ballet's emphasis on elevation.",
        "Emotion and Individualism": "Modern dance often focuses on emotional expression and individual interpretation.",
        "Freedom of Costume Choice": "Unlike ballet, modern dance doesn't require specific costumes; dancers often perform in bare feet.",
        "Choreography": "The process of creating dance. In modern dance, choreography is often experimental and innovative.",
        "Performance Art": "Modern dance can intersect with performance art, incorporating elements like spoken word or visual arts.",
        "Spontaneity": "A sense of improvisation and in-the-moment decision-making can be an important part of modern dance.",
        "Collaboration": "Modern dance often involves collaboration between dancers, choreographers, and sometimes audience members.",
        "Interdisciplinary Nature": "Modern dance can incorporate elements of other performance arts, such as theater or music.",
        "Site-Specific Dance": "Modern dance doesn't have to take place on a traditional stage; it can be adapted to different locations.",
        "Body Awareness": "Modern dance often emphasizes a conscious understanding and use of the body's movements and limitations.",
        "Dance Composition": "The arrangement of movement in space and time; in modern dance, composition can be highly experimental."
    }
}