{
    "options": [
        "Pitch",
        "Rhythm",
        "Melody",
        "Harmony",
        "Dynamics",
        "Tempo",
        "Articulation",
        "Form",
        "Timbre",
        "Key signature",
        "Time signature",
        "Note values",
        "Rest values",
        "Musical symbols",
        "Intervals",
        "Scales",
        "Chords",
        "Triads",
        "Phrases",
        "Motifs"
    ],
    "hints": {
        "Pitch": "The highness or lowness of a musical sound, determined by the frequency of its vibrations.",
        "Rhythm": "The arrangement of sounds and silences in time, creating a pattern of beats and accents.",
        "Melody": "A series of pitches played in a sequence, forming a recognizable musical idea.",
        "Harmony": "The simultaneous combination of pitches, creating chords and chord progressions.",
        "Dynamics": "The volume or loudness of a musical sound, indicated by symbols such as p (piano) for soft and f (forte) for loud.",
        "Tempo": "The speed or pace of a piece of music, measured in beats per minute (BPM).",
        "Articulation": "The way notes are played, such as smoothly (legato) or detached (staccato).",
        "Form": "The overall structure of a piece of music, including sections and phrases.",
        "Timbre": "The unique quality or tone color of a musical sound, which distinguishes it from other instruments or voices.",
        "Key signature": "A set of sharps or flats at the beginning of a staff, indicating the key of the piece.",
        "Time signature": "A symbol that shows how many beats are in each measure and what type of note gets one beat.",
        "Note values": "The duration of a note, such as a whole note, half note, quarter note, etc.",
        "Rest values": "The duration of silence in music, corresponding to the note values.",
        "Musical symbols": "Signs and symbols used in sheet music to represent various elements of music.",
        "Intervals": "The distance between two pitches, measured in steps or half steps.",
        "Scales": "A series of pitches in ascending or descending order, such as major, minor, or pentatonic scales.",
        "Chords": "A group of three or more pitches played simultaneously or in close succession.",
        "Triads": "A type of chord consisting of three pitches, such as major, minor, diminished, or augmented triads.",
        "Phrases": "Short musical ideas or sections, usually 4 to 8 measures long, that make up a melody or larger musical structure.",
        "Motifs": "A short musical idea, usually just a few notes, that is repeated or developed throughout a piece of music."
    }
}