{
    "options": [
        "Ethics",
        "Metaphysics",
        "Epistemology",
        "Aesthetics",
        "Logic",
        "Free will",
        "Determinism",
        "Dualism",
        "Materialism",
        "Empiricism",
        "Rationalism",
        "Utilitarianism",
        "Deontology",
        "Existentialism",
        "Relativism",
        "Absolutism",
        "Skepticism",
        "Idealism",
        "Humanism",
        "Nihilism"
    ],
    "hints": {
        "Ethics": "The study of what is morally right and wrong, and how people should act in various situations.",
        "Metaphysics": "The branch of philosophy that deals with the nature of existence, reality, and the universe.",
        "Epistemology": "The study of knowledge, how we acquire it, and how we can differentiate between true and false beliefs.",
        "Aesthetics": "The study of beauty, art, and the nature of our experiences with them.",
        "Logic": "The study of reasoning and argument, which helps us analyze and evaluate the validity of statements and arguments.",
        "Free will": "The concept that humans have the ability to make choices that are not determined by external factors or fate.",
        "Determinism": "The belief that all events, including human actions, are predetermined and inevitable, often due to natural laws or divine intervention.",
        "Dualism": "The belief that the mind and body are two separate entities that interact with each other.",
        "Materialism": "The belief that everything in the universe, including the mind, is composed of physical matter.",
        "Empiricism": "The idea that knowledge comes primarily from sensory experience and observation.",
        "Rationalism": "The idea that knowledge is gained through reason and logical thinking, rather than through sensory experience.",
        "Utilitarianism": "An ethical theory that states that the best action is the one that maximizes overall happiness or pleasure.",
        "Deontology": "An ethical theory that states that the morality of an action is based on rules or duties, rather than its consequences.",
        "Existentialism": "A philosophical approach that emphasizes the importance of individual experience, choice, and personal responsibility in shaping one's own life.",
        "Relativism": "The belief that moral and ethical principles are not universal but instead depend on individual or cultural perspectives.",
        "Absolutism": "The belief that there are universal moral and ethical principles that apply to everyone, regardless of individual or cultural differences.",
        "Skepticism": "The philosophical attitude of doubting or questioning the reliability of knowledge and beliefs.",
        "Idealism": "The belief that reality is fundamentally mental or spiritual in nature, rather than physical or material.",
        "Humanism": "A philosophical and ethical stance that emphasizes the value and agency of human beings and the importance of critical thinking and rational inquiry.",
        "Nihilism": "The belief that life has no inherent meaning or purpose, and that moral values are arbitrary or subjective."
    }
}