{
    "options": [
        "Centripetal force",
        "Force",
        "Conduction",
        "Convection",
        "Radiation",
        "Mechanical advantage",
        "Fluid dynamics",
        "Air resistance",
        "Terminal velocity",
        "Fluid pressure",
        "Bernoulli's principle",
        "Pascal's principle",
        "Archimedes' principle",
        "Force",
        "Motion",
        "Speed",
        "Velocity",
        "Acceleration",
        "Newton's Laws of Motion",
        "Gravity",
        "Friction",
        "Mass",
        "Weight",
        "Energy",
        "Potential energy",
        "Kinetic energy",
        "Work",
        "Power",
        "Simple machines",
        "Waves",
        "Light",
        "Reflection",
        "Refraction"
    ],
    "hints": {
        "Force": "any interaction that, when unopposed, changes the motion of an object",
        "Motion": "The change in an object's position over time.",
        "Speed": "The distance traveled by an object per unit of time.",
        "Velocity": "The speed of an object in a specific direction.",
        "Acceleration": "The rate at which an object's velocity changes over time.",
        "Newton's Laws of Motion": "Three fundamental laws that describe the relationship between the motion of an object and the forces acting on it.",
        "Gravity": "The force of attraction between any two masses, like the Earth pulling objects toward its center.",
        "Friction": "The force that opposes the motion of an object when it is in contact with another object or surface.",
        "Mass": "The amount of matter in an object, which is related to its weight.",
        "Weight": "The force exerted on an object due to gravity.",
        "Energy": "The capacity to do work or cause change, which can be converted from one form to another.",
        "Potential energy": "The stored energy an object has due to its position or condition.",
        "Kinetic energy": "The energy an object has due to its motion.",
        "Work": "The transfer of energy when a force moves an object over a distance.",
        "Power": "The rate at which work is done, or energy is transferred.",
        "Simple machines": "Basic mechanical devices that make work easier, such as levers, pulleys, and inclined planes.",
        "Waves": "Disturbances that transfer energy from one point to another, like sound waves or water waves.",
        "Light": "A form of electromagnetic radiation that allows us to see and is responsible for the colors we perceive.",
        "Reflection": "The bouncing of light waves off a surface, like a mirror.",
        "Refraction": "The bending of light waves as they pass from one medium to another, like when light passes through water or a lens.",
        "Centripetal force": "force that acts on an object moving in a circular path, directed toward the center of the circle",
        "Conduction": "transfer of heat through a material without the movement of the material itself",
        "Convection": "transfer of heat by the movement of a fluid, such as air or water",
        "Radiation": "transfer of energy through space in the form of electromagnetic waves",
        "Mechanical advantage": "ratio of the force produced by a machine to the force applied to it",
        "Fluid dynamics": "study of the motion and behavior of fluids, like liquids and gases",
        "Air resistance": "force that opposes the motion of an object through the air",
        "Terminal velocity": "maximum constant speed an object can reach while falling through a fluid, like air",
        "Fluid pressure": "force exerted by a fluid on an object submerged in it",
        "Bernoulli's principle": "principle stating that as the speed of a fluid increases, its pressure decreases",
        "Pascal's principle": "principle stating that a change in pressure at any point in an enclosed fluid is transmitted equally to all parts of the fluid",
        "Archimedes' principle": "principle stating that the buoyant force on an object submerged in a fluid is equal to the weight of the fluid displaced by the object"
    }
}