{
    "options": [
        "Emotions",
        "Memory",
        "Learning",
        "Perception",
        "Motivation",
        "Social interaction",
        "Personality",
        "Cognitive development",
        "Empathy",
        "Self-esteem",
        "Stress",
        "Coping mechanisms",
        "Communication",
        "Problem-solving",
        "Mindfulness",
        "Positive thinking",
        "Body language",
        "Attention",
        "Behavior",
        "Goal setting"
    ],
    "hints": {
        "Emotions": "Feelings such as happiness, sadness, anger, or fear that people experience in response to situations or events.",
        "Memory": "The ability to store, retain, and recall information and experiences.",
        "Learning": "The process of acquiring new knowledge, skills, or behaviors through experience or teaching.",
        "Perception": "The way we interpret and understand the world around us using our senses.",
        "Motivation": "The force that drives us to achieve goals or fulfill needs and desires.",
        "Social interaction": "The way people relate to and communicate with one another, affecting their relationships and behavior.",
        "Personality": "The unique combination of traits, characteristics, and behaviors that make up an individual's character.",
        "Cognitive development": "The growth and development of thinking, reasoning, and problem-solving abilities.",
        "Empathy": "The ability to understand and share the feelings of others, and to respond with care and compassion.",
        "Self-esteem": "A person's overall sense of self-worth or value, affecting their confidence and self-image.",
        "Stress": "The body's response to physical or emotional demands, which can be both positive and negative.",
        "Coping mechanisms": "Strategies people use to manage stress or difficult emotions, such as problem-solving or seeking support.",
        "Communication": "The exchange of information, thoughts, or feelings between people through speaking, writing, or non-verbal signals.",
        "Problem-solving": "The process of finding solutions to difficult or complex issues or situations.",
        "Mindfulness": "A mental state of focusing on the present moment and accepting it without judgment, often used as a technique to reduce stress and increase self-awareness.",
        "Positive thinking": "A mental attitude that emphasizes the optimistic side of situations and expects positive outcomes.",
        "Body language": "Non-verbal communication through facial expressions, gestures, posture, and other physical movements.",
        "Attention": "The ability to selectively focus on specific aspects of the environment while ignoring others.",
        "Behavior": "The way a person acts or responds to stimuli, influenced by their thoughts, emotions, and experiences.",
        "Goal setting": "The process of establishing and working towards specific, measurable, achievable, relevant, and time-bound objectives."
    }
}