{
    "options": [
        "Empirical Process Control",
        "Self-Organizing Teams",
        "Collaboration",
        "Cross-Functional Teams",
        "Timeboxing",
        "Iterative Development",
        "Continuous Improvement",
        "Prioritization",
        "Incremental Delivery",
        "User Involvement",
        "Flexibility",
        "Sustainable Pace",
        "Focus",
        "Transparency",
        "Inspect and Adapt",
        "Definition of Done",
        "Respect",
        "Courage",
        "Commitment",
        "Visibility"
    ],
    "hints": {
        "Empirical Process Control": "Scrum is based on transparency, inspection, and adaptation, allowing teams to make data-driven decisions and adapt to change.",
        "Self-Organizing Teams": "Scrum teams are encouraged to self-organize and make decisions collectively, without relying on a top-down management approach.",
        "Collaboration": "Scrum emphasizes close collaboration between the team members and stakeholders, enabling effective communication and shared understanding.",
        "Cross-Functional Teams": "Scrum teams are composed of members with diverse skill sets, which enables them to handle all aspects of the project without depending on external resources.",
        "Timeboxing": "All Scrum events, such as Sprints, Daily Stand-ups, Sprint Planning, Sprint Review, and Sprint Retrospective, have a predefined duration, ensuring efficient time management.",
        "Iterative Development": "Scrum focuses on delivering small, incremental improvements, allowing teams to learn and adapt as they progress through the project.",
        "Continuous Improvement": "Scrum teams continuously inspect and adapt their processes, aiming to improve their performance and product quality.",
        "Prioritization": "Scrum emphasizes prioritizing work based on business value, ensuring that the most valuable features are developed and delivered first.",
        "Incremental Delivery": "Scrum promotes delivering working, usable increments of the product at the end of each Sprint, ensuring a continuous flow of value to the stakeholders.",
        "User Involvement": "Scrum emphasizes the involvement of end-users and stakeholders throughout the development process, ensuring that their needs and feedback are taken into account.",
        "Flexibility": "Scrum allows for changing requirements and priorities, enabling teams to adapt to new information and evolving business needs.",
        "Sustainable Pace": "Scrum encourages maintaining a sustainable work pace, ensuring that the team can consistently deliver high-quality work without burnout.",
        "Focus": "Scrum promotes concentrating on a limited set of tasks within each Sprint, ensuring that the team remains focused and committed to delivering the agreed-upon objectives.",
        "Transparency": "Scrum relies on transparency in decision-making, progress tracking, and information sharing, enabling effective communication and trust-building.",
        "Inspect and Adapt": "Scrum teams regularly inspect their work and processes, adapting to improve efficiency and effectiveness based on feedback and lessons learned.",
        "Definition of Done": "Scrum teams establish a shared understanding of what it means for work to be completed, ensuring consistency and quality across the project.",
        "Respect": "Scrum promotes a culture of respect, valuing each team member's unique skills, experiences, and perspectives.",
        "Courage": "Scrum encourages team members to be courageous in making decisions, embracing change, and addressing challenges.",
        "Commitment": "Scrum teams commit to achieving the Sprint goals and continuously improving their performance.",
        "Visibility": "Scrum artifacts, such as the Product Backlog, Sprint Backlog, and Increment, provide visibility into the team's progress and help manage expectations."
    }
}