{
    "options": [
        "Society",
        "Culture",
        "Socialization",
        "Social Norms",
        "Social Roles",
        "Social Stratification",
        "Social Class",
        "Social Mobility",
        "Social Institutions",
        "Social Interaction",
        "Group Dynamics",
        "Deviance",
        "Social Control",
        "Race and Ethnicity",
        "Family",
        "Education",
        "Religion",
        "Mass Media",
        "Social Change"
    ],
    "hints": {
        "Society": "A group of people sharing a common culture, territory, and way of life.",
        "Culture": "The shared beliefs, values, customs, and material objects that characterize a group of people.",
        "Socialization": "The process through which individuals learn and internalize the values, norms, and expectations of their society.",
        "Social Norms": "The shared expectations about appropriate behavior within a society or group.",
        "Social Roles": "The set of expectations attached to a particular social position or status.",
        "Social Stratification": "The hierarchical arrangement of social classes or groups within a society based on factors like wealth, power, and prestige.",
        "Social Class": "A group of people who share a similar social, economic, or occupational status in society.",
        "Social Mobility": "The ability of individuals or families to move up or down the social ladder within a society.",
        "Social Institutions": "Organized structures and systems within a society that serve to meet its basic needs, such as family, education, government, and religion.",
        "Social Interaction": "The ways in which people communicate, cooperate, and relate to one another within a society.",
        "Group Dynamics": "The patterns of interaction and relationships among individuals within a group.",
        "Deviance": "Behavior that violates social norms or expectations.",
        "Social Control": "The mechanisms used by a society to enforce conformity to its norms and values.",
        "Race and Ethnicity": "Categories of social identification based on physical characteristics, ancestry, and cultural practices.",
        "Family": "A social institution that unites individuals into cooperative groups, typically through marriage and/or biological ties.",
        "Education": "A social institution responsible for transmitting knowledge, skills, and values from one generation to the next.",
        "Religion": "A social institution that involves shared beliefs, values, and rituals related to the sacred or supernatural.",
        "Mass Media": "Communication channels (e.g., television, radio, newspapers, and the internet) that reach a large audience and have a significant influence on society.",
        "Social Change": "The transformation of a society's culture, institutions, and social structures over time."
    }
}