{
    "options": [
        "Declaration of Independence (1776)",
        "U.S. Constitution (1787)",
        "Bill of Rights (1791)",
        "Checks and Balances",
        "Manifest Destiny",
        "Louisiana Purchase (1803)",
        "War of 1812",
        "Trail of Tears (1838-1839)",
        "Abolition Movement",
        "Women's Suffrage Movement",
        "Civil War (1861-1865)",
        "Reconstruction Era (1865-1877)",
        "Industrial Revolution",
        "World War I (1914-1918)",
        "The Great Depression (1929-1939)",
        "World War II (1939-1945)",
        "Civil Rights Movement (1954-1968)",
        "Vietnam War (1955-1975)",
        "Cold War (1947-1991)",
        "September 11, 2001"
    ],
    "hints": {
        "Declaration of Independence (1776)": "A document that declared the 13 American colonies' independence from British rule.",
        "U.S. Constitution (1787)": "The foundational document that outlines the framework of the U.S. government.",
        "Bill of Rights (1791)": "The first ten amendments to the Constitution, protecting individual liberties and rights.",
        "Checks and Balances": "A principle ensuring that no single branch of government becomes too powerful.",
        "Manifest Destiny": "The 19th-century belief that the United States was destined to expand across North America.",
        "Louisiana Purchase (1803)": "The acquisition of land from France that doubled the size of the United States.",
        "War of 1812": "A conflict between the United States and Great Britain, often considered the \"Second War of Independence.\"",
        "Trail of Tears (1838-1839)": "The forced relocation of Native American tribes, resulting in thousands of deaths.",
        "Abolition Movement": "A social and political movement that sought to end slavery in the United States.",
        "Women's Suffrage Movement": "The fight for women's right to vote, culminating in the 19th Amendment (1920).",
        "Civil War (1861-1865)": "A war between the Northern and Southern states, primarily over the issue of slavery.",
        "Reconstruction Era (1865-1877)": "The period following the Civil War, focused on rebuilding the nation and granting rights to freed slaves.",
        "Industrial Revolution": "A period of rapid industrial growth and innovation in the United States during the late 19th and early 20th centuries.",
        "World War I (1914-1918)": "A global conflict in which the United States participated from 1917-1918, helping to secure an Allied victory.",
        "The Great Depression (1929-1939)": "A severe economic downturn that led to widespread unemployment and poverty.",
        "World War II (1939-1945)": "A global conflict in which the United States played a major role, contributing to the defeat of the Axis powers.",
        "Civil Rights Movement (1954-1968)": "A struggle for racial equality, leading to significant social and legal changes.",
        "Vietnam War (1955-1975)": "A controversial conflict between North and South Vietnam, with the United States supporting the South.",
        "Cold War (1947-1991)": "A period of political and military tension between the United States and the Soviet Union, without direct armed conflict.",
        "September 11, 2001": "Terrorist attacks on U.S. soil that led to significant changes in national security policies and ongoing military action in the Middle East."
    }
}