{
    "options": [
        "innovative",
        "derivative",
        "responsible",
        "exploitative",
        "transparent",
        "deceptive",
        "ethical",
        "manipulative",
        "sustainable",
        "shortsighted",
        "inclusive",
        "discriminatory",
        "empowering",
        "oppressive",
        "collaborative",
        "monopolistic",
        "proactive",
        "reactive",
        "well-researched",
        "anecdotal",
        "strategic",
        "haphazard",
        "equitable",
        "favoritest",
        "compassionate",
        "callous",
        "accountable",
        "evasive",
        "growth-oriented",
        "complacent",
        "environmentally friendly",
        "damaging",
        "adaptable",
        "rigid",
        "data-driven",
        "assumptive",
        "long-term success",
        "short-term gains",
        "community-minded",
        "self-serving",
        "perseverance",
        "empathy",
        "curiosity",
        "gratitude",
        "integrity",
        "adaptability",
        "collaboration",
        "determination",
        "optimism",
        "creativity",
        "responsibility",
        "patience",
        "respect",
        "kindness",
        "communication",
        "resourcefulness",
        "humility",
        "confidence",
        "initiative",
        "honesty"
    ],
    "hints": {
        "innovative": "Like being a super inventor, always coming up with cool and new ideas!",
        "derivative": "Like copying your friend's drawing but changing it a little bit.",
        "responsible": "Being like a superhero who always does what they promise and takes care of stuff.",
        "exploitative": "Like a sneaky villain who takes advantage of others for their own fun.",
        "transparent": "Like a see-through jellyfish, being open and honest about everything.",
        "deceptive": "Like a tricky magician who makes you believe something that isn't true.",
        "ethical": "Like a wise wizard who always does what's right and fair for everyone.",
        "manipulative": "Like a puppet master, controlling people to do what they want.",
        "sustainable": "Taking care of the Earth, like planting a tree that lasts forever.",
        "shortsighted": "Like looking through a telescope the wrong way and only seeing what's right in front of you.",
        "inclusive": "Like a big, warm hug that welcomes everyone to join the fun.",
        "discriminatory": "Like a grumpy gatekeeper who only lets certain people in.",
        "empowering": "Like getting a superpower that makes you feel strong and able to do anything.",
        "oppressive": "Like a mean giant who doesn't let anyone play or have fun.",
        "collaborative": "Like a team of superheroes working together to save the day.",
        "monopolistic": "Like a bossy king who wants to control everything and not share.",
        "proactive": "Like a scout who prepares and plans for adventures before they happen.",
        "reactive": "Like a bouncy ball that only moves when someone else starts the action.",
        "well-researched": "Like a detective who finds all the clues and solves the mystery.",
        "anecdotal": "Like a storyteller who shares fun tales from their adventures.",
        "strategic": "Like a mastermind who plans the best ways to win games.",
        "haphazard": "Like throwing paint everywhere and hoping it makes a cool picture.",
        "equitable": "Like a fair referee who makes sure everyone gets a turn and plays by the rules.",
        "favoritest": "Like a teacher who always picks their favorite student, even if it's not fair.",
        "compassionate": "Like a big-hearted hero who cares for everyone and helps them when they're sad.",
        "callous": "Like an ice queen who doesn't care if others are hurt or upset.",
        "accountable": "Like a brave knight who owns up to their mistakes and tries to make things right.",
        "evasive": "Like a ninja who avoids answering questions and slips away from responsibility.",
        "growth-oriented": "Like a gardener who keeps learning and growing stronger plants.",
        "complacent": "Like a lazy cat who's happy to just lay in the sun and not do anything.",
        "environmentally friendly": "Like a nature-lover who keeps the planet clean and safe for all creatures.",
        "damaging": "Like a tornado that causes harm and destruction wherever it goes.",
        "adaptable": "Like a chameleon that changes colors to fit into any situation.",
        "rigid": "Like a statue that doesn't change or bend, no matter what happens.",
        "data-driven": "Like a robot who only makes decisions based on numbers and facts.",
        "assumptive": "Like a fortune teller who jumps to conclusions without knowing the whole story.",
        "long-term success": "Like planting a magic beanstalk that grows taller and stronger over time.",
        "short-term gains": "Like finding a shiny coin, but it doesn't last long because it's only chocolate.",
        "community-minded": "Like a caring neighbor who brings everyone together for a big block party.",
        "self-serving": "Like a greedy goblin who only thinks about themselves and what they can get.",
        "perseverance": "Like a determined ant that never gives up, even when carrying a heavy load.",
        "empathy": "Like a kind-hearted friend who understands how you feel and helps you feel better.",
        "curiosity": "Like an explorer who always asks questions and loves to discover new things.",
        "My apologies for the incomplete response earlier. Here are the remaining fun definitions": "",
        "gratitude": "Like a thankful squirrel who's happy for every acorn it finds.",
        "integrity": "Like a noble lion who stands up for what's right, even when no one is looking.",
        "adaptability": "Like a clever octopus that can change and adjust to different situations.",
        "collaboration": "Like a group of friends who build an amazing sandcastle together.",
        "determination": "Like a brave mountain climber who keeps going, even when it's tough.",
        "optimism": "Like a happy sunflower that always looks on the bright side and faces the sun.",
        "creativity": "Like a colorful artist who paints the world with their imagination.",
        "responsibility": "Like a helpful big sibling who looks after their younger brothers and sisters.",
        "patience": "Like a wise turtle who knows that slow and steady wins the race.",
        "respect": "Like a polite knight who always treats others with kindness and honor.",
        "kindness": "Like a warm, fluffy blanket that makes everyone feel loved and cared for.",
        "communication": "Like a group of animals who speak different languages but still understand each other.",
        "resourcefulness": "Like a smart inventor who makes amazing things out of everyday objects.",
        "humility": "Like a humble bee who does important work without needing to show off.",
        "confidence": "Like a fearless dragon who knows they can do anything they set their mind to.",
        "initiative": "Like a go-getter who starts their own lemonade stand to help others.",
        "honesty": "Like a truthful owl who always speaks the truth, even when it's hard."
    }
}